[{"id":"061771b0-88b9-4e88-a40c-00268ffb756a","title":"Security Best Practices for Microsoft Azure Applications","Abstract":"Learn about threats to data and applications hosted on Microsoft Azure and countermeasures appropriate to address each threat. The best practices discussed in this session can be used to secure the Azure.","speakers":[{"id":"cbc3c106-13ed-41c1-8c5b-165683d92263","name":"Varun Sharma","twitterHandle":null,"tagline":"Principal Security Engineer, MSIT Microsoft India","bio":"Varun Sharma is a Principal Security Engineer in Microsoft IT’s Information Security & Risk Management team. He has 8 years of experience in application security and has been working on securing Microsoft’s line of business applications on Azure for the past few years. Varun has a Masters in Information Security from Royal Holloway, University of London and a Bachelor of Engineering degree in Computer Science from Pune University.","headshotUrl":"http://teched2013.blob.core.windows.net/images/92fd9728-7e3d-44a8-8f7b-d75881d71841","photo":null}],"begins":"2014-11-05T18:05:00","ends":"2014-11-05T19:00:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"661e1214-653f-468b-8cbe-0c3a2fde4f66","title":"Demystifying InMemory capabilities & architectures with SQL Server 2014","Abstract":"In-Memory features are the flagship features of SQL Server 2014. In this session, we will go over three areas of functionality which leverage in-memory database technology: In-Memory OLTP, In-memory Data Warehousing, and Buffer Pool Extension. In-Memory OLTP introduces a new optimistic multi-versioned concurrency control (MVCC) model for memory-optimized tables that is lock-free and supports the isolation levels SNAPSHOT, REPEATABLE READ, and SERIALIZABLE. We explain how SQL Server achieves these isolation levels without taking locks. We will look at the innards of In-Memory OLTP transactions, and touch on concepts such as transaction validation, commit dependencies, and the read-, write-, and scan-sets. For each area, we’ll go over the motivations, the technology behind the scenes, and the real-world customer benefit delivered.","speakers":[{"id":"5a4e53ae-f9b4-4adf-b78f-26a9bc9d1600","name":"Vinod Kumar M","twitterHandle":null,"tagline":"MTC- Technical Architect, Microsoft India","bio":"Vinod Kumar has worked with SQL Server extensively for more than a decade now. Working on various versions from SQL Server 7.0, Oracle 7.3 and other database technologies, he now works with Microsoft Technology Center (MTC) as a Technology Architect. With extensive database, BI and application background, he currently helps customers maximize investments on technologies to solve real world business, architecture and technology integration problems. He has worked on various roles and projects involving development, migration, deployment, networking, architecture, testing, performance troubleshooting, packaging, R&D for services and product based companies. Vinod holds 26+ Microsoft certification on various technologies till date and was a MVP in SQL Server for more than 3 years. He has published several articles on SQL Server in his site www.ExtremeExperts.com, as well as on other third party sites. He has also authored two books - SQL Server Interview Questions and Answers for all Database Developers and Database Administrators and SQL Server 2012 AlwaysOn Joes 2 Pros (R): A Tutorial for Implementing High Availability and Disaster Recovery Using Alwayson Availability.","headshotUrl":"http://teched2013.blob.core.windows.net/images/1e236373-2652-4100-9113-88b78dafc147","photo":null}],"begins":"2014-11-05T16:00:00","ends":"2014-11-05T16:55:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"a7dce2a6-0a3a-4545-8b65-0d94fea82ce3","title":"DocuDB - Deep Dive","Abstract":"Azure now offers a native Document Database-as-a-Service offering, DocumentDB. This is afully-managed, scalable, NoSQL document database service with rich queryand indexing capabilities over a schema-free JSON data model. In this demo-oriented session, we'll take a deeper look into DocumentDB, going into topics such: • Nested documents and properties • Multi-schema collections • Iteration • Joins • User-Defined Functions • Linq and lambdas • REST API","speakers":[{"id":"919b5128-d735-4456-a4b5-bd26404f9968","name":"David Makogon","twitterHandle":null,"tagline":"Sr. SDE, Microsoft","bio":"David Makogon has been a software creationist and architect for over 25 years. He’s currently a Senior Azure Architect at Microsoft, and was an Azure MVP prior to joining Microsoft. David spends lots of energy in the user community, speaking at user groups, conferences and code camps. Outside of computing, David is an avid photographer and family man, with a penchant for puns and an uncanny ability to read backwards.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c75a3c2e-431d-48cc-9046-1afdc2c9c62f","photo":null}],"begins":"2014-11-06T10:45:00","ends":"2014-11-06T11:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"c22f4238-d283-4496-993f-0e47a087f83e","title":"First-class open source integration for Azure applications","Abstract":"From Web Sites and Service Bus to Virtual Machines, this demo-full session will explore Azure’s open source capabilities, cover some common patterns & practices and illustrate how new or existing Azure applications can be extended using open source. Come learn more about PHP, Java, Node.js and Linux on Azure, and how Microsoft can help you extend your open source investments with an enterprise grade, hyper-scale, hybrid and open cloud.","speakers":[{"id":"ec26908b-a113-42a1-9a74-901b7273ca38","name":"Jose Miguel Parrella","twitterHandle":null,"tagline":"Business Program manager, Microsoft USA","bio":"José Miguel is an open source CTO in Microsoft’s Marketing & Operations team in Redmond. Originally from Venezuela, he joined Microsoft in 2010. For the last 10 years he has been developing enterprise-grade open source solutions for customers in the Americas and for partners like HP and IBM. He’s an open source enthusiast and a Debian Developer. He was the lead architect of Canaima 2.0, the national Linux distribution of Venezuela, and a regular speaker in open source events in Latin America, Europe and the Middle East who has authored technical publications including “Instant Debian: Build a Web Server”","headshotUrl":"http://teched2013.blob.core.windows.net/images/414e54fa-21e8-46bb-9e74-64ed50df3515","photo":null}],"begins":"2014-11-06T13:45:00","ends":"2014-11-06T14:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"63053200-5590-42ea-bf59-14f0cb59d27a","title":"Machine Learning for the masses: Azure ML in action","Abstract":"The buzzwords over the last few years have been 'Big Data', 'Analytics' and so on. However, if you are wondering how you can make these real for your applications and scenarios, and do not have any PhDs in your staff, AzureML might just be the saving grace for you. With AzureML, we now have a radical approach to making Machine Learning simple and accessible to the masses. However, at the same time you will also see the power of AzureML while incorporating custom R scripts to achieve your objectives. You will also see how you can take your trained model and create a production web service, which your application can utilize to score requests. All of this will be made easy with demos from many verticals and with easy to understand explanations.","speakers":[{"id":"ee706f8a-5915-44a3-845f-7ae9eccc514f","name":"Arvind Shyamsundar","twitterHandle":null,"tagline":"Principal PFE, Microsoft Services","bio":"Arvind provides proactive advice and support to Microsoft Premier Customers for their Data Platform (SQL) requirements. He is a Microsoft Certified Master (MCM) for SQL Server. He loves big data – in both relational and other forms. His current line of interest is to make Machine Learning more accessible to our customers and partners, and what better way to show that, than by applying ML principles to day-to-day scenarios in sectors like equity trading and sports analytics. In his day job at Microsoft, Arvind is also responsible for the proactive offerings such as the SQL Server RAP as a Service Program, and also multiple WorkshopPLUS titles. A key focus area for him is developing proactive checks and tooling for examining T-SQL code and database design. In his free time Arvind blogs at http://aka.ms/arvindsh and is active on Twitter (http://www.twitter.com/arvisam).","headshotUrl":"http://teched2013.blob.core.windows.net/images/0838696f-efab-4442-a14d-68d5c9125e2e","photo":null},{"id":"3eac355c-93e6-4bf4-bf62-74fa8cad4435","name":"Sunil Kumar BS","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft India","bio":"Sunil is an Escalation Engineer working with SQL team. He have close to 10 years of experience at Microsoft working on SQL Developer and BI technologies. Sunil has been involved on publishing various tools for end users and general public consumption. He is an Expert in SQL BI and Data Access technologies with unique approach of troubleshooting highly complex issues and works directly with the SQL Product team on fixing these issues and product improvements.","headshotUrl":"http://teched2013.blob.core.windows.net/images/34d0c08a-7c1b-4d80-a42a-720363a56ece","photo":null}],"begins":"2014-11-06T10:45:00","ends":"2014-11-06T11:40:00","location":"Magadh 2","Trackid":"3ed6a267-6b27-4dcd-b191-77cc558efc7e","TrackName":"Business Intelligence"},{"id":"248deca0-a491-4cf2-a693-15b0d33372d7","title":"Powershell 4.0: Desired State Configuration fundamentals","Abstract":"DSC is a new management platform in Windows PowerShell that enables deploying and managing configuration data for software services and managing the environment in which these services run. DSC provides a set of Windows PowerShell language extensions, new Windows PowerShell Cmdlets, and resources that you can use to declaratively specify how you want your software environment to be configured. It also provides a means to maintain and manage existing configurations. Come see how DSC works and how you can use it to make configuration of internal applications, databases and other infrastructure elements more efficient.","speakers":[{"id":"d17960ff-366b-4fca-8628-dea82a6841f7","name":"Ritesh Modi","twitterHandle":null,"tagline":"Senior Consultant, Microsoft ","bio":"Ritesh is a Senior Consultant with Microsoft Services. He has over a decade of experience in working and delivering on high end, mission critical solutions with customers and partners globally. He also works with customers and partners worldwide, helping them to plan, envision, architect, design, implement / deploy and revamp solutions on or around the Microsoft product platform, He also has a proven track record of delivering successfully on high value projects. He is also a WorldWide Subject Matter Expert in Microsoft within the Modern Datacenter Community. Recently, he bagged Microsoft’s Best Community Member award for his passion and contribution towards DSC, Powershell, private cloud and Azure. He has delivered numerous sessions at Microsoft on DSC, System Center products, Powershell and Azure IaaS. He is also an avid blogger on automation related technologies including DSC, Orchetrator and Powershell. His blogs are available at http://automationnext.wordpress.com","headshotUrl":"http://teched2013.blob.core.windows.net/images/90e7f371-2af8-4d65-ba7f-56e285592ba0","photo":null},{"id":"4467259c-b1af-423f-971d-71a0fcaeb171","name":"Aman Sharma","twitterHandle":null,"tagline":"Consultant, Microsoft","bio":"Aman, a consultant with Microsoft Services Global Delivery, has been in IT for more than 6 years. He has been working with System Center Orchestrator and other automation tools to build private clouds. He is a technology enthusiast who loves all things related to automation and private clouds. In his free time he loves swimming and playing games on Xbox.","headshotUrl":"http://teched2013.blob.core.windows.net/images/52e03c41-3696-4c76-b164-b5ea3d4fa77e","photo":null}],"begins":"2014-11-06T14:45:00","ends":"2014-11-06T15:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"0839188b-981f-4ea3-a204-15cbd9051869","title":"Architecting Open source solutions on Azure","Abstract":"The Microsoft cloud platform offers more than Windows-based software—there’s plenty of support for open source technologies. This session takes a broad look at the open source offerings that Azure provides today. The goal is to give you a big-picture perspective on what the options are and when to use them with key focus on App, data and insights options. Session talks about the various architectural considerations around using php, mysql and other open source technologies, drawing from real world projects.","speakers":[{"id":"9b5af114-bc28-480a-8737-1395471566ac","name":"Nicholas Dristas","twitterHandle":null,"tagline":"Senior Director, APAC Azure CAT Microsoft Corporation ","bio":"Nicholas Dritsas has been working with SQL Server, Business Intelligence and Windows Azure for the past 16+ years as part of Microsoft Consulting Services (MCS), SQL Server and Windows Azure Product Group. In his time at MCS, he acted as a Lead Architect to a number of Fortune 500 SQL Server and BI implementations, including Hilton Hotels, Nestle USA and Walt Disney. Since 2006, he joined the Cloud & Enterprise Division’s Customer Advisory Team as a Senior Director working with the largest and most complex SQL Server, Azure and BI projects in Asia, such as Samsung Electronics, AirAsia, ThomsonReuters plus leading the Asia chapter of CAT team. Nicholas has presented numerous times in internal and external events and conferences around BI subjects and best practices.","headshotUrl":"http://teched2013.blob.core.windows.net/images/dcea79d7-db9b-4eb7-977a-92b1fc548501","photo":null}],"begins":"2014-11-05T11:45:00","ends":"2014-11-05T12:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"7e869780-c678-44f9-8682-16dfadf27a5c","title":"Creating Amazing Experiences with Intel(R)\"","Abstract":"This sessions introduces you to various tools and SDKs Intel(R) has developed to enable developers in creating amazing computing experiences. Come learn about what Intel(R) Galileo Board offers and ways in which you can use the latest Intel(R) RealSense(TM) SDK 2014 in your apps, making them ready for tomorrow's devices.\"","speakers":[{"id":"873a79b5-abd7-42c2-8655-bc1391443c9e","name":"Raghavendra Ural","twitterHandle":null,"tagline":"Developer Evangelist, Intel","bio":"Raghavendra is an evangelist and a speaker. In the past, he gave talks on IOT, Windows 8 Sensors, HTML5, Intel XDK and Intel Perceptual computing. His IT journey started 14 years back. During this journey he worked on various web and enterprise technologies. Currently he is responsible for evangelizing IOT for Intel. Raghavendra enjoys meeting people, sharing knowledge, understanding technical challenges and providing solutions. He is currently working as Developer Evangelist for Developer Relationships Division @ Intel. You can reach him on twitter: @ragural LinkedIn: in.linkedin.com/in/ragural/","headshotUrl":"http://teched2013.blob.core.windows.net/images/7f2d56a3-5603-430e-bc59-11b3d752e517","photo":null},{"id":"b80de951-2d33-4bdb-ae3f-c77c79956368","name":"Shwetha Doss","twitterHandle":null,"tagline":"Sr. Application Engineer, Intel","bio":"Shwetha is a Sr. Application Engineer at the Software and Service group at Intel Corporation working on enabling application on the next generation Intel(R) core processors and Intel® RealSense technology. Previously at Intel, Shwetha was a technical consultant on the Intel Performance team, where she worked on optimizing the ISV application for Intel architecture. Shwetha holds a master's degree in Computer Science from the Portland State University.","headshotUrl":"http://teched2013.blob.core.windows.net/images/d6b7f781-a0e0-44b5-94cb-35878c15f09e","photo":null}],"begins":"2014-11-06T16:00:00","ends":"2014-11-06T16:55:00","location":"Kalinga 2","Trackid":"59459941-34cf-4e60-acf4-24646e63550a","TrackName":"IoT"},{"id":"f97140d6-b2f9-4e05-a241-1baf9e21ddcc","title":"Protect your business running in Azure using Microsoft Azure Backup Service","Abstract":"There is a growing trend of organizations, small and large, adopting Azure for running their business critical applications. Although Azure provides high availability and local redundant and geo replicated storage, application based backup and recovery is still a challenge and customers expect the same level of protection they are used to on-premises. Many customers are planning to deploy hundreds of Azure IaaS VMs and thousands of databases and for all these applications data protection becomes a mandatory requirement. Join us to find out about key investments we are making in Azure Backup Service to protect Azure IaaS VMs as well as guest workloads like SQL running in Azure. Azure Backup Service is also expanding its reach to include several geos and adding support for down-level Operating Systems such as Win2K3 and Win2K8.","speakers":[{"id":"97156684-3385-4893-be85-2c8369ebec6f","name":"Aashish Ramdas","twitterHandle":null,"tagline":"Program Manager, Microsoft India","bio":"Aashish is a Program Manager in Microsoft who specializes in data protection products. He is currently part of team that works on key backup and archival products for cloud and workload protection, including System Center Data Protection Manager and Microsoft Azure Backup. His experience in ranges from building telecom products in his earlier days to Hyper-V Replica during his tenure in Microsoft. Aashish has a computer sciences background with an MBA in Marketing.","headshotUrl":"http://teched2013.blob.core.windows.net/images/55343c70-a5af-4999-9e5b-ec397a0afba3","photo":null}],"begins":"2014-11-06T16:00:00","ends":"2014-11-06T16:55:00","location":"Magadh 1","Trackid":"61e1822f-1059-4020-bdb3-5c88e7d2f6f4","TrackName":"Online Services"},{"id":"8b4924ee-7148-4d1d-8fb7-1ca01a266bd9","title":"How to become a Data Scientist using Azure Machine Learning","Abstract":"This session talks about how MAML helps one do data science using Machine Learning","speakers":[{"id":"ac89c711-7dc1-4494-9118-a19fc6586bdc","name":"Saket Suman","twitterHandle":null,"tagline":"Consultant, Microsoft Consulting Services India","bio":"Saket is a Consultant with Microsoft Consultancy Services India and has got around 13 years of Industry experience with 2 years of strong experience in the area of Data Science and Machine Learning. He is an Architect in the areas ofBig Data and IoT as well.","headshotUrl":"http://teched2013.blob.core.windows.net/images/23ae86b1-8ff8-4386-908d-c5f6bc608b4f","photo":null},{"id":"48c7ea16-ad4e-4312-b1d3-b8b8760519b5","name":"Vikas Goyal","twitterHandle":null,"tagline":"Senior Consultant, Microsoft Consulting Services, India","bio":"Vikas works as a Senior Consultant at MCS India. His areas of focus include Customer Experience, Cloud Application Platform, DevOps & Machine Learning. He has a decade of product engineering experience and now designs and builds modern applications with customers and partners.","headshotUrl":"http://teched2013.blob.core.windows.net/images/fc765901-1bfc-47ba-b59b-86180f4acc11","photo":null}],"begins":"2014-11-05T10:45:00","ends":"2014-11-05T11:40:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"},{"id":"93e8cf7d-51c6-4526-bf8c-1cb1d2c8e356","title":"Sending Cross Platform Notifications using Notifications Hub","Abstract":"Learn How to use Azure Notifications Hub to send notifications to cross platform Devices. May it be Windows, Android, or iOS; Notification Hub let you manage all your devices registrations for notifications and even send targetted notifications to users.","speakers":[{"id":"f5c5552f-01a6-4158-8d9e-53804312d0f2","name":"Abhishek Narain","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft India","bio":"As a Technical Evangelist at Microsoft India, Abhishek helps developers adapt to the latest Microsoft technologies. Previously, he was a consultant at Microsoft focused on ASP.NET, Azure, Windows Phone, Client web technologies and Game development. He is a regular speaker at Microsoft TechEd, .NET User Groups. Prior to Microsoft, Abhishek was working at Infragistics – a leading UI/UX company. He has worked extensively on HTML5 and was awarded the Microsoft MVP award while working outside Microsoft.","headshotUrl":"http://teched2013.blob.core.windows.net/images/79b071bb-3390-44f1-8073-41cb00894fd6","photo":null},{"id":"126f5de9-3bb3-4592-8a21-c3e4b38cec46","name":"Sukriti Sharma","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft India","bio":"Sukriti Sharma is a Technical Evangelist in Developer Experience and Evangelism team at Microsoft India. She primarily works on Microsoft technologies like C#/XAML, Windows app development and Azure Websites.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9241e1bf-126e-49ce-a50f-fcf088af9a36","photo":null}],"begins":"2014-11-05T18:05:00","ends":"2014-11-05T19:00:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"0cc1c661-bc18-41c1-a4c0-1e5beef48a76","title":"Real-word Internet of Things with Microsoft Azure","Abstract":"This session will focus on realizing real-world IoT scenarios with Microsoft Azure. While there is a lot of interest in IoT in the industry there is also the notion that IoT is futuristic.. We challenge this and talk about what can be done here and now with devices and the Azure cloud infrastructure. In consideration are different IoT patterns and design considerations involved making the right choices for different needs. Then we will discuss on how a whole new stack of technologies available as services on Azure and specially designed for IoT needs and can be layered to create powerful solution architectures. In this regard there will be spotlight on EventHubs, Orleans, Notification Hubs, HD Insight, real-time analytics etc and how to combine them gainfully. We will also demonstrate examples of realizations and delve into how they work in practice.","speakers":[{"id":"8f140579-b08a-457a-a357-4275af44e7ea","name":"Rangarajan Srirangam","twitterHandle":null,"tagline":"Senior Program Manager, Azure CAT Microsoft Corporation ","bio":"Rangarajan Srirangam is a Senior Program Manager in the Azure Customer Advisory (Azure CAT) team. He has 18 years of experience in the IT Industry in different roles and has been associated with Microsoft for the past 13 years. He has consulted on diverse projects for large customers and delivered complex solutions spanning multiple Microsoft technologies. Ranga specializes on Windows Azure and the developer and data platforms. He has been a key speaker in several events like Tech Ed, Tech Ready, and Architect Summits etc. and has also published numerous technical papers. He currently represents the Azure CAT team in India and works with field teams and customers on projects of high scale and complexity on specific workloads on Azure especially IoT.","headshotUrl":"http://teched2013.blob.core.windows.net/images/e6eea02b-bea1-4727-aadc-d5ba658e1d0c","photo":null},{"id":"8a30dc15-476f-49fc-a643-497ecb89046e","name":"Gurucharan B","twitterHandle":null,"tagline":"Senior Consultant, MCS Microsoft India","bio":"Over 13 years of experience in the IT Industry spanning development, consulting, architecture in OLTP and DWH Database Systems. Guru Charan is currently a Senior Consultant, in the Microsoft Consulting Services team where his focus areas include SQL Technologies, Business Intelligence, SQL Azure and the .NET platform. In his 9 years at Microsoft, Guru Charan has worked as Technical Lead in Product Technical Support, Premier Field Engineer and Consulting teams and has been conferred to number of awards. In his current role as Senior Consultant of India MCS, he built relationships with the largest and most complex solutions including migration from Micro strategy to Microsoft BI, implementing dashboard at almost all SI’s in India.","headshotUrl":"http://teched2013.blob.core.windows.net/images/244b5539-ea43-4e5a-be19-67b613054df0","photo":null}],"begins":"2014-11-05T10:45:00","ends":"2014-11-05T11:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"bd1c7b89-5f18-42c4-a15a-1e934dc25962","title":"ASP.NET MVC – Latest & Greatest Features So Far","Abstract":"In this session we will take a lap around the latest and greatest things that ASP.NET MVC has to offer. Currently ASP.NET MVC is at version 5.2. A lot of goodies have been made available as part of the ASP.NET MVC tooling. We will be taking a look at features of MVC such as One ASP.NET Experience, Bootstrap Integration, ASP.NET MVC Scaffolding and Attribute Routing. These features were made available over 3 releases namely 5, 5.1 and 5.2. In this session, I will try to go through major items of interest in 1 hour. By the end of this session you will be up-to-date with the things ASP.NET MVC has to offer and will help you in your day to day work on ASP.NET MVC.","speakers":[{"id":"969b5115-9ad6-4f53-931a-cb6b867d2a63","name":"Lohith G N","twitterHandle":null,"tagline":"Technical Evangelist, Telerik","bio":"Lohith is a Microsoft MVP for ASP.NET/IIS. He has been awarded MVP status for 4 years now. He is part of Bangalore DotNet User Group (BDotNet) and helps BDotNet with the day to day activities. He is regular speaker in local user groups. When he is not coding, he likes to listen to music and watch television shows like Friends, Castle.","headshotUrl":"http://teched2013.blob.core.windows.net/images/8ff234d0-4458-460b-a063-3082975b5824","photo":null}],"begins":"2014-11-06T13:45:00","ends":"2014-11-06T14:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"15ac67f9-de42-45a7-847a-24b59e91ccce","title":"Big Data Visualization","Abstract":"Big data is being discussed everywhere, thought by different industries in different ways, multiple big data products out there helping customers achieve their business needs. In this session we will show you how to work with data using Microsoft Cloud big data platform “HDInsight”, how to visualize data, what visualization considerations to be considered, etc.,. This session will cover the data visualization principle, different ways of extracting and visualizing data from HDInsight and custom visualization solution using Avanade Touch Analytics an interactive cross platform multi-device visualization tool","speakers":[{"id":"615d0a4c-caa4-4f6d-bc46-fc248561936c","name":"Suman Sundar","twitterHandle":null,"tagline":"Senior Data &amp; Analytics Architect, Accenture India","bio":"Suman is the Data & Analytics Capability Lead for India Delivery Center. Suman has over 11 years of core experience in Data Warehouse, Business Intelligence, Big data, Analytics & Data Visualization. In his role he looks after the new technology adoption, evangelizing across the organization and building customer focused offerings on Data & Analytics platform. He is passion about new technology trends including IoT, Cloud and Mobility where he has built customer facing innovative solutions. He is part of Data Platform Advisors and Office Pre-release Microsoft social communities.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9ed35bf1-aeeb-420d-9cf8-e76ebbc81955","photo":null},{"id":"168d525e-6f38-46d9-b52a-7ac5ff6128af","name":"Vidya Sagar Dudipala","twitterHandle":null,"tagline":"Technical Architect, Accenture India","bio":"Vidya Sagar is a Senior SME & Technology Evangelist at Avanade India and his areas of expertise include Business Intelligence, SQL Server as well as advanced analytics. He has been working with Microsoft's products & technologies for over 9 years spanning pre-packaged analyticsproduct development, consulting and architecture and review of BI solutions.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c97036f3-dc68-4b9b-ac2a-66e1a254dfac","photo":null}],"begins":"2014-11-06T14:45:00","ends":"2014-11-06T15:40:00","location":"Magadh 2","Trackid":"3ed6a267-6b27-4dcd-b191-77cc558efc7e","TrackName":"Business Intelligence"},{"id":"83116f28-a4ee-4fd4-82cb-2632567604cf","title":"A pragmatic approach to building high availability services on Microsoft Azure","Abstract":"Microsoft Azure provides the 99.95% SLAs for availability with outbound roles. The session talks about multiple considerations one has to take into account towards achieving high availability for the services on Microsoft Azure by dwelling into the capabilities of Azure features such as Traffic Manager and industrialization using DevOps. The session also talks about building resiliency in the cloud architecture that helps as well achieve the high availability services.","speakers":[{"id":"d0d5ca04-fe99-4618-b845-39d3997b727b","name":"Laxmikant Bhole","twitterHandle":null,"tagline":"Azure Senior Architect, Accenture","bio":"Laxmikant works at Accenture as Azure Senior Architect. He has rich 17+ years of industry experience on variety of Microsoft technologies with his primary skill being architecting solutions on .NET and Microsoft Azure. He has been actively working on Microsoft Azure since its first CTP. In his role he is helping customers in adopting Microsoft Azure technology and implementing complex solutions on Azure. He leads the Microsoft Azure capability in Accenture and is responsible for capability enhancements within his organization. He is also an active member on Microsoft Azure community","headshotUrl":"http://teched2013.blob.core.windows.net/images/97489ec8-802b-445c-8774-ad27645af450","photo":null},{"id":"1df4f968-0cba-4239-a369-32426fffdccc","name":"Kunal Chandratre","twitterHandle":null,"tagline":"Microsoft Azure Architect, Accenture","bio":"Kunal is Microsoft Azure MVP and works @ Accenture as Microsoft Azure Architect. He has 8+ years of industry experience with variety of Microsoft Technologies; .NET and Azure being primary skill set. In his current role, he works with customers providing the help in Architecting and implementing Azure solutions. He is a very active member in various Microsoft Communities and passionate 'Speaker' in many events. You can follow him: @kunalchandratre or more on his blog - http://sanganakauthority.blogspot.com/","headshotUrl":"http://teched2013.blob.core.windows.net/images/39c2a7d0-1672-4e9d-8359-25fc3ddba06c","photo":null}],"begins":"2014-11-05T13:45:00","ends":"2014-11-05T14:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"2436de60-ca89-4e2a-b78d-2a10c4f21143","title":"Data Privacy and Security in Microsoft Azure","Abstract":"Data Privacy and security is top of mind for enterprises looking to run applications in the cloud. In this session, you'll learn what capabilities Azure offers to help safeguard data in transit and at rest through access controls, encryption, and more. Get ready to learn data Privacy and security which is key to design and run enterprise applications.","speakers":[{"id":"2a7a26c2-83c9-44f4-838f-23a97387e5d4","name":"Wasim Bloch","twitterHandle":null,"tagline":"Senior Consultant, Microsoft Global Services Center, India","bio":"Wasim is a Senior Consultant at Microsoft Global Services Center, Bangalore. He has over 15 years of experience in executing large engagements specific to solution designing, delivery management and presales in various Microsoft technologies such as Microsoft Azure, .NET, Integration, SQL Server, ASP.NET. Wasim is also responsible for helping clients and partners envision architect, design, implement and revamp solutions in Microsoft Azure.","headshotUrl":"http://teched2013.blob.core.windows.net/images/382f5a4c-e94d-4e31-89b6-f1be517d5dbf","photo":null}],"begins":"2014-11-05T16:00:00","ends":"2014-11-05T16:55:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"},{"id":"dca345a0-f1e4-427e-aaf9-2ed1c4851bb1","title":"Best practices to optimize Hyper-V deployment","Abstract":"System deployment refers to a very common task for IT departments: setting up a computer system with all the software it needs — the operating system, base set of applications and OS hardening. Like many enterprise customers out there, if you also have the following queries in your mind, then this session will surely help you to get answers to those queries with help of live demos and real world scenarios: • How can I optimize and standardize my overall OS deployment? • If deploying Custom image then what should be my imaging strategy? • How to provide flexibility to end user of choosing any approved \"Optional\" application? • Should I backup computers before deployments? • How should I dynamically configure setting for all enterprise users? Additionally, this session will focus on wide variety of customizations and automation that is possible for achieving fully automated OSD infrastructure using native Microsoft technologies.","speakers":[{"id":"8a908333-d429-473f-a381-9419057eb411","name":"Gaurav Anand","twitterHandle":null,"tagline":"Technology Specialist, Microsoft India","bio":"Gaurav Anand is Certified PMP and Datacenter Technology Specialist who was awarded Microsoft Most Valuable Professional award for two consecutive years. Gaurav is currently responsible for adoption of Microsoft Datacenter and Cloud technologies by Enterprises across South and East India and also works with Microsoft Partners enabling ecosystem. As part of Microsoft EPG, Gaurav helps Large corporate accounts to solve their most critical business challenges. Prior to this Gaurav has worked in variety of roles getting exposure of Consulting, Project Management and Premier IT Support.","headshotUrl":"http://teched2013.blob.core.windows.net/images/610fc361-836b-4c31-b7a3-ed696b411286","photo":null}],"begins":"2014-11-05T11:45:00","ends":"2014-11-05T12:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"c6a6ebd4-fa88-4eec-96fa-31a4097a5009","title":"Open Web Technologies and SharePoint – An “arranged marriage\"","Abstract":"You love your applications built with open web technologies like PHP, Node.js, etc. that allow you to get your work done. You wish these \"non-Microsoft\" apps were also available in your corporate enterprise portal based on SharePoint and Office 365, but did not know how to achieve it. Come and learn how to integrate these apps built using open web technologies inside SharePoint on Office 365.","speakers":[{"id":"0b9511cf-7020-44a8-bbfa-be366438cf2d","name":"Abhisek Banerjee","twitterHandle":null,"tagline":"Technical Architect, MTC, Microsoft India","bio":"Abhisek is an Architect at the Microsoft Technology Center, Bangalore. He works with customers to understand their business goals and highly complex requirements, and provides technology and architectural guidance that impacts the strategic directions and decisions for their enterprise. Over the years, he has architected enterprise solutions on different Microsoft technologies across product development organizations and services organizations. He currently focusses on how enterprises can leverage the Microsoft Productivity platform to address their business priorities. Abhisek holds an MBA from IIM Bangalore and loves to dwell on the intriguing world of the financial markets as a hobby.","headshotUrl":"http://teched2013.blob.core.windows.net/images/b0de79e6-6d7c-49cd-b5d6-f156174addd1","photo":null}],"begins":"2014-11-06T11:45:00","ends":"2014-11-06T12:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"e6400df6-d04e-44dd-95a0-340ce754895e","title":"SQL Server Data Tools - Unleashing a power tool for DB and BI Work loads","Abstract":"SQL Server Data Tools (SSDT) is a Visual Studio Suite that allows database users to build, debug, maintain and refactor database objects. It supports code navigation, intellisense and provides for automatic source control. With SSDT, databases can be published just like websites; The same tool can be leveraged for BI work loads such as SSIS, SSAS and SSRS. In the demo heavy session we will explore all aspects of data storage, processing and reporting from a single tool.","speakers":[{"id":"0059b574-9281-48e9-a312-07acbe12f121","name":"Deepthi Anantharam","twitterHandle":null,"tagline":"Technology Evangelist, Microsoft India","bio":"Deepthi has been working on various data technologies for 11 years now. She is an engineer from Bangalore University and an alumnus of International Institute of Information Technology - Bangalore. Currently she is working with Microsoft Corporation India as a Technology Evangelist. In her present role, she works with developers and IT professionals across India evangelizing Microsoft Technologies. Primarily, she focuses on SQL Server, Business Intelligence, Azure and related technologies. Prior to Microsoft, she has worked in different startups in the BI space in the retail and banking domain. When she’s not at work, she likes to spend time with her family and friends and loves to visit new places.","headshotUrl":"http://teched2013.blob.core.windows.net/images/bc8190bc-59e4-428f-a25e-872b84a9bf47","photo":null}],"begins":"2014-11-05T14:45:00","ends":"2014-11-05T15:40:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"1833c277-d8bf-4c65-8202-396e9fb9fc3f","title":"Welcome Note","Abstract":null,"speakers":[{"id":"5a16be0e-4857-4c73-90ba-053009103072","name":"Tyler Bryson","twitterHandle":null,"tagline":"General Manager, Marketing &amp; Operations, Microsoft India ","bio":"Tyler Bryson oversees marketing and operations for Microsoft's India subsidiary. He functions as Microsoft’s Chief Marketing Officer for India and has broad responsibility for all sales, marketing and services operations. Tyler's responsibilities span both consumer and commercial customers as well as the Microsoft partners that serve these customers. Tyler has over 20 years of experience in the software industry in a variety of executive sales and marketing positions. Prior to his current role, Tyler worked as Microsoft's General Manager for the Enterprise and Partners Group in the Southwest United States. Tyler also worked as the General Manager for Marketing and Sales for United States Manufacturing and Resources Sector. In this role Tyler led Microsoft's sales, marketing and partner strategy for the High Tech, Automotive, Industrial Equipment, Oil & Gas and Utilities industry verticals. Before joining Microsoft, Tyler was the Vice President of Sales and Marketing for QuickStart Technologies, an IT services firm that focused on helping organizations understand and apply Microsoft technology. Tyler is focused on helping Microsoft grow through finding and retaining new customers by creating desire for Microsoft services and devices. He is passionate about building connected sales and marketing initiatives to drive revenue and market share growth in new markets. He is working to acquire the next 100M new digital consumers for Microsoft in India. Tyler received his bachelor's degree from Brigham Young University and his MBA from the Wharton School of the University of Pennsylvania.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c5addcc3-ab5e-47db-aa42-2dba8c1a136b","photo":null}],"begins":"2014-11-05T09:30:00","ends":"2014-11-05T09:40:00","location":"Kalinga 1","Trackid":"f446cc16-0e92-4ade-9f43-b74528948b89","TrackName":"Keynote"},{"id":"393ac2f5-0a97-4124-b0b6-3e06a68121c7","title":"Best Practices to deploy Software Defined Networks for a Private Cloud using Windows Server","Abstract":"This session focuses on the best practices for deploying Software Defined Networks (SDN) using Windows Server 2012 R2. We present examples from the field and show what to do for a successful deployment and what to avoid. The session would also focus on Threshold investments made in the area of SDN and Network Function Virtualization (NFV), to service, deploy and manage hybrid clouds. We will introduce the Network Controller that will provide the new control plane for hybrid cloud deployments. The NFVs would enable delivery of application focused cloud scale services. This talk introduces some of the new NFV focused features that will be released in Threshold and its applicability to Private Clouds and specifically in telecommunication networks.","speakers":[{"id":"d3cf3e9e-06fd-470a-98a0-812ae6f7c1a3","name":"Vithalprasad Gaitonde","twitterHandle":null,"tagline":"Sr Program Manager, Microsoft India","bio":"Vithalprasad Gaitonde is Senior Program Manager working on Software Defined Networking in the Windows Server Networking team at IDC. His other responsibilities in the networking team include Windows DNS, DHCP and IP Address management. He has worked on several releases of Windows Server starting with Windows Server 2008 R2 through Windows Server 2012 R2. Prior to Microsoft, Prasad worked at Novell in Netware OS, Novell Directory Services. He has worked with directory related working groups at IETF and Open Group. Prasad holds a Masters from IIT, Bombay and a MBA from IIM, Bangalore.","headshotUrl":"http://teched2013.blob.core.windows.net/images/cf2a3617-cc8a-4528-8404-fd5bb1c9c66e","photo":null}],"begins":"2014-11-06T13:45:00","ends":"2014-11-06T14:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"e73807ee-4fc7-4b81-bec6-46b759c8edda","title":"Getting started with Universal Games with Unity","Abstract":"This talk will help you get started with Unity and cover key concepts needed to build quality Universal games . We’ll talk showcase the Unity IDE and work with Visual Studio to build a quick game targeting Windows and Windows Phone.","speakers":[{"id":"02102c0d-c20f-44c0-976f-d0e643085915","name":"Ujjwal Kumar","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft ","bio":"Ujjwal Kumar is a Technical Evangelist for Windows Phone, Windows 8, Microsoft Azure platform and IoT in Microsoft's Developer Experience & Evangelism (DX) group. He focuses on apps and game development. Prior to this, he worked as a Partner Consultant and Development Platforms Worldwide Specialization Lead at Microsoft. He has 11 years of industry experience, of which over 8 years has been with Microsoft. In the past, he has extensively worked on C++, C#, Microsoft Azure, Windows Internals, Robotics Studio, Game development and image processing. In his current role, he assists business, start-ups, enterprises and partner organizations in adoption of latest platform and technologies. He is an avid technologist, a prominent speaker and also the founder of \"India Gamers Community\".","headshotUrl":"http://teched2013.blob.core.windows.net/images/abb8df8d-c778-4d4d-92db-f2523220b906","photo":null},{"id":"6fff037b-5f70-49f6-8e4c-aeadb70265bd","name":"Saurabh Kirtani","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft ","bio":"Saurabh Kirtani is a Technical Evangelist in Microsoft India’s Developer Experience and Evangelism team. He works on Microsoft technologies like the .NET Framework, C# language, Windows app development and Azure. His current focus is on .Net Framework, Azure and Unity. Apart from technology, he likes to follow cricket and lawn tennis, watch comedy/suspense TV shows and spend time on Quora.","headshotUrl":"http://teched2013.blob.core.windows.net/images/bfea6463-1440-4240-a2d9-cc169007a222","photo":null}],"begins":"2014-11-05T14:45:00","ends":"2014-11-05T15:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"969c12ea-b400-48fc-8629-4a7eaef85038","title":"Building the next generation IoT solutions using Event Hub & Near Real Time Streaming on Azure","Abstract":"IoT is the next big thing that the world has sat up and taken a look at. One fundamental requirement of building a solution for Internet of Things is the ability to receive and process millions of data points from a wide variety of devices and be able to perform real time querying on that. This demo will take you through an IoT scenario, where an application is continuously monitoring temperatures of rooms in a building through sensors ranging in 100,000's and adjusting the Air conditioning of each room accordingly. The application is built completely on Azure's scalability platform including Eventhub, the latest component on Azure.","speakers":[{"id":"9d8a9fb5-dbce-4dc7-9415-dfe21cc2cfbe","name":"Shweta Gupta","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft","bio":"Shweta is a Senior program manager in Microsoft, who specializes on Azure. Her expertise lies in enabling, building and migration of big data workloads onto Azure, focusing on re-architecting for short term as well as long term. With over nine years of work experience in various Microsoft technologies, Shweta is now associated with Azure since the last three years. Shweta has a computer applications background with an MBA in Finance. In the past she has written papers and spoken at several international conferences on application of information technology in the financial reporting domain.","headshotUrl":"http://teched2013.blob.core.windows.net/images/54bbef47-705f-4bad-84e9-aa3e7ca8a573","photo":null},{"id":"e8bbfd5e-9c2f-4e82-b2e6-b77723e3326a","name":"Juan Pablo Garcia Gonzalez","twitterHandle":null,"tagline":"Senior Technical Evangelist, Microsoft","bio":"Juan Pablo Garcia Gonzalez is a Senior Technical Evangelist working in the Technical Evangelism and development team (TED Americas). He works as a technical expert on Azure platform working with a primary focus on CSVs in America. In the recent months, he has worked on many Azure Media Services projects. Juan Pablo is an electronic engineer with a master’s degree and broad experience in cloud computing.","headshotUrl":"http://teched2013.blob.core.windows.net/images/5ddc7891-37ee-4bc8-9882-4c2750aa5eb4","photo":null}],"begins":"2014-11-06T17:00:00","ends":"2014-11-06T17:55:00","location":"Kalinga 2","Trackid":"59459941-34cf-4e60-acf4-24646e63550a","TrackName":"IoT"},{"id":"b1c7de15-3bc1-40f3-b707-4b2eb85d1d14","title":"Experience True Enterprise Mobility in 55 mins","Abstract":"In this ever changing IT landscape, every enterprise aims at enabling People Centric IT where the Cloud is embraced and data is secured while keeping productivity high and employees mobile. Join us for an hour ride which would be a good mix of presentations, demos & experience sharing on Enterprise Mobility Suite. Get insights into how you can leverage this comprehensive cloud solution to tackle consumerization of IT, BYOD and SaaS challenges through latest cloud services like Windows Intune, Microsoft Azure Active Directory Premium and Microsoft Azure Rights Management.","speakers":[{"id":"65ba7f77-3f75-43ca-9a82-4a492eb2814d","name":"Anirudh Singh Rautela","twitterHandle":null,"tagline":"Sr. Product Marketing Manager, Microsoft India","bio":"Anirudh is a Sr. Product Marketing Manager for Management and Identity and Access businesses in the Server and Cloud Business Group. He holds a Master’s degree in Computer Applications with nearly thirteen years of experience in information security. Over the last one and a half year, he has been driving the Modern Datacenter business for Microsoft in India. Additionally, Anirudh also runs the Security & Privacy Initiative to keep our customers and partners protected and secure at all times. His experience spans designing Layered Security Architectures for large enterprises, vulnerability assessments, device risk assessment and application security testing. He has steered information security policies and procedures, conducted BS 7799 audits and formalised Business Continuity Plans for various organisations. Combining his security knowledge with that of the requirements of Modern Datacentres, Anirudh is able to drive in-depth conversations around end-to-end customer requirements. Anirudh has also represented Microsoft at various external events and has been a key event speaker.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9b916326-85ac-4f26-9482-9f10637303e0","photo":null},{"id":"c5896755-a982-4f8e-a23c-d0186a7da855","name":"M S Anand","twitterHandle":null,"tagline":"MTC – Technical Architect, Microsoft India  ","bio":"As a Technical Architect with Microsoft Technology Center, M.S. Anand enables partners & customers to envision, design and deploy the right Microsoft solutions to meet their exact needs. His areas of expertise include directory services, virtualization, private and hybrid clouds, and more recently, Azure IaaS. With a wide range of technological experience over his 17 years in the industry, Anand has been assisting partners & customers in rapidly finding solutions to their technology challenges. He is a familiar face at Microsoft events and is a Microsoft Certified Solution Expert (MCSE) on Server Infrastructure & Private Cloud.","headshotUrl":"http://teched2013.blob.core.windows.net/images/08da06ad-7690-4310-acc8-e9a7af9fb73c","photo":null}],"begins":"2014-11-05T14:45:00","ends":"2014-11-05T15:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"5053a6d7-d40a-4c51-a591-4d97826f63c2","title":"Best practices to plan, deploy and operate Cloud Data Center using Windows Server vNext","Abstract":"This session focuses on the advances made in the network infrastructure management services in the Windows Server vNext, to operate cloud datacenter networks. The session will have details about the capabilities like (1) having the network insight of the cloud data center infrastructure (network, compute and storage) and deducing a network topology and it’s interconnection; (2) validation of the discovered network topology against the desired/goal network topology for the appropriateness of physical network configuration/wiring; (3) automated configuration of cloud data center infrastructure including network devices like ToRs and aggregate switches via standard based management platform that supports desired state configuration; (4) auditing and tracking the network health and its impact due to loss, latency and availability of the physical network of the cloud datacenter with the help of active probes placed across the fault-domains of the network. The cloud data center operations is consolidated with several improvements made in the IP Address Management (IPAM) vNext feature like IP addressing lifecycle management and the integrated management of core network services like DNS and DHCP, powered with granular role-based access control across multiple datacenters. The session would also cover the investments made in network infrastructure services for cloud data center like cloud DNS offering.","speakers":[{"id":"2a905d97-b021-4a62-84ef-9f099eb80e67","name":"Mahesh Narayanan","twitterHandle":null,"tagline":"Principal Program Manager Lead, Microsoft","bio":"Mahesh Narayanan is Principal PM Manager, working in the Windows Networking division and is responsible for the IP Address Management (IPAM) feature and cloud data center/enterprise network automation capabilities in the Windows Server. Mahesh has an overall industry experience of more than 15 years with expertise in cloud computing, software defined networking (SDN), enterprise networking, network security and managed services. Mahesh has worked on core networking technologies like DHCP, DNS, IPv6, remote access technologies like VPN, S2S, and also in network management and operations solution areas like – network management system (NMS), IP address management (IPAM), and security event and information management (SEIM).","headshotUrl":"http://teched2013.blob.core.windows.net/images/83acdbed-ac85-43e7-8d15-1a311fa416f3","photo":null}],"begins":"2014-11-05T10:45:00","ends":"2014-11-05T11:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"f6f10894-9f71-4b03-852c-52e6b390a358","title":"Keynote","Abstract":null,"speakers":[{"id":"60a854c7-4039-485a-bc78-0f1126bef43e","name":"Jason Zander","twitterHandle":null,"tagline":"Corporate Vice President, Cloud &amp; Enterprise, Microsoft ","bio":"Jason Zander’s team responsibilities include the architecture and development of core Azure technologies (such as compute, storage, networking, public cloud data centers and engineering systems). Before joining the Azure team, Jason was CVP of engineering for the Visual Studio team and has worked on numerous products at Microsoft including the first several releases of the CLR and .NET Framework, SourceSafe, and ODBC. Before joining Microsoft in 1992, Jason worked at IBM on Distributed SQL and SQL/400 at the Rochester lab. Jason holds a Bachelor of Science in Computer Science from MSU.","headshotUrl":"http://teched2013.blob.core.windows.net/images/b8170d0a-e909-411a-9676-a0ca32a87120","photo":null}],"begins":"2014-11-05T09:40:00","ends":"2014-11-05T10:30:00","location":"Kalinga 1","Trackid":"f446cc16-0e92-4ade-9f43-b74528948b89","TrackName":"Keynote"},{"id":"282934a6-c45a-406e-b9a1-5582adf09aa0","title":"Microsoft Azure vs. Amazon Web Services: A Fair Trial","Abstract":"Cloud Computing Landscape has taken a giant leap in the last 12-14 months and it only gets better as we move forward. Competition is always good which pushes each of the leading cloud vendors to innovate on their core platform offerings. Be it Virtual Machines, Databases, Notifications, Storage, Mobile Services or Cloud Services, the list goes on. Join this session and educate yourself on how Azure and AWS stack up on the capability front. You have questions on the capability front, we will help you unearth answers.","speakers":[{"id":"43213a39-01e3-4842-b9bc-9cc8bfb1d332","name":"Sandeep Alur","twitterHandle":null,"tagline":"Lead Evangelist, Microsoft India ","bio":"Sandeep Alur has over 15 years of industry experience working with a range of clientele in India and across the globe. At Microsoft, he leads the Technical Evangelism Charter for India, and works with the developer & partner ecosystem to provide them a foundation for building solutions on the Windows Platform. He believes that 'Apps' are central to engaging consumers in order to make them productive in the real world and ‘Quality’ will be the biggest differentiator. In addition, with the explosion of devices and services, he considers ‘Cloud platform’ to be a great host for businesses to scale. With a rich background of providing technology and architectural guidance to Enterprise customers, Sandeep's experience ranges from the dotcom days to the next generation distributed and cloud computing technologies on Microsoft Platform. He has architected solutions across the Microsoft Technology Suite and is a stern believer of his own philosophy, which says “Enterprise architecture is an evolution and it grows with innovation”. Sandeep has authored quite a few articles in the area of SOA, ESB, Enterprise Framework, Distributed Computing technologies, Web 2.0, Next Generation Web, and Cloud Computing to name a few. You can follow him on twitter @saalur.","headshotUrl":"http://teched2013.blob.core.windows.net/images/2b947870-87ba-428b-a419-61e07652d79a","photo":null},{"id":"5f7fe831-30c2-4d44-b0e2-ce22ca608710","name":"Mahesh Patel","twitterHandle":null,"tagline":"Tech Evangelist, Microsoft India","bio":"Mahesh Patel is an Architect Advisor working with Microsoft's DX SIgroup, India.Mahesh currently works with Global System Integrators (SI) in India to help them adopt the latest & upcoming Microsoft products & technologies as part of their service offerings for their customers. As part of this role, Mahesh is responsible for the overall engagement, program and relationship management with select SI partners from a DX SI perspective. Mahesh also engages with partner architects in specific technology areas, helping them see the potential of the Microsoft platform.","headshotUrl":"http://teched2013.blob.core.windows.net/images/491f86b0-f230-4f08-866e-113c9fbe1db9","photo":null}],"begins":"2014-11-05T18:05:00","ends":"2014-11-05T19:00:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"},{"id":"b5eafb67-78a6-4b82-a36e-57b7d25723b5","title":"Notes from the field – Microsoft Azure Cloud Services","Abstract":"As the transformational era of cloud computing kicks in and more new application development moves to the cloud, balanced use of Platform as a Service (PaaS) and Infrastructure as a Service becomes indispensable. As the focus on hardware disappears and apps take center stage, it becomes imperative to understand how PaaS components like Microsoft Azure Cloud Services can help build great, highly scalable and robust applications on the cloud. In this session, we will share the Icertis experience of building enterprise apps on the Azure platform and dive deep into how we built robust, scalable and performant cloud services. This will be a nuts and bolts session on how to enable monitoring, fault tolerance and availability for robustness, and how to auto-scale while keeping costs in check for scalability and performance. We will go behind the scenes on how cloud services work, the integrated health, monitoring and load-balancing features as well as the development and deployment experience.","speakers":[{"id":"b5da63fd-d7db-498c-86ae-b94683892bc2","name":"Monish Darda","twitterHandle":null,"tagline":"Chief Technology Officer, Icertis","bio":"Monish has more than 20 years of experience in application and systems software development and the architecting of enterprise distributed systems. Along with Unmesh, he co-founded Websym Technologies in 1998. He set up and headed the India R&D operation of Storability, an enterprise storage management startup from Boston. Storability was eventually acquired by Sun Microsystems after which Monish founded and led the India R&D of BladeLogic, helping build a highly scalable enterprise platform for server management in the data center. BladeLogic was acquired by BMC Software after a successful IPO, and Monish contributed to BMC's cloud management vision, laying the foundation for some of the early pioneering work on cloud resource management and provisioning. He is also the co-inventor of two patents in this area. Monish has a BE in Mechanical Engineering and a Master's degree from Florida Atlantic University, Boca Raton, Florida, USA. In his spare time, Monish is a self-proclaimed \"gadget freak\" and \"gamer\" and loves his Xbox Kinect and PS3 Move systems (he just outgrew the Wii a few months ago) and often claims that video games keep him fit! His other interests are Formula 1 and reading. He is a sci-fi aficionado and loves Isaac Asimov.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9b2e0561-f66b-4889-b66d-b8d48e67c3be","photo":null}],"begins":"2014-11-05T13:45:00","ends":"2014-11-05T14:40:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"},{"id":"0b1393af-7856-4701-8f8b-600d77c41173","title":"Windows 2003 End of Support: Why, What and How ?","Abstract":"This session will focus on the networking options and possibilities. We will discuss and demonstrate how to connect a Windows Azure Virtual Network to an on-premises network effectively creating a private data center in the Cloud. Windows 2003 Server will go out of support in July 2015. While time is ticking away, there are still millions of servers running mission critical business apps, infra apps and other applications.","speakers":[{"id":"39525a51-bce9-46e9-98fd-863bf8f072a5","name":"Ashok Srinivasan","twitterHandle":null,"tagline":"Architect, Microsoft India","bio":"Ashok Srinivasan is an Architect with Microsoft Consulting Services, Global Delivery (GD), focusing on IT infrastructure solutions. Currently, he helps organizations migrate their IT infrastructure to Cloud and/or virtualized platforms. In the past, he has built several innovative solutions that help organizations remain compliant, improve their IT efficiency and enhance security. Under the Windows 2003 End of Support initiative, he is part of the Worldwide Center of Excellence (CoE) team in Microsoft that is building innovative solutions, accelerating platform assessment and migration processes.","headshotUrl":"http://teched2013.blob.core.windows.net/images/0b64efb6-b47e-42c8-93c2-6f02bc7442b1","photo":null}],"begins":"2014-11-06T10:45:00","ends":"2014-11-06T11:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"c53c5fb1-507c-4b3c-97c0-623f027fa7aa","title":"Enhancing SQL Server Performance with ColumnStore Index","Abstract":"Designing a data warehouse database to achieve break-through performance has always been a tough nut to crack for the developers or architects. With clustered CSI, SQL 2014 provides database designers the perfect tools to achieve break-through performances and lower hardware costs, while removing the limitations around SQL 2012.","speakers":[{"id":"a84fc534-3eda-4df1-a84d-67e6ab748ca2","name":"Sourabh Agarwal","twitterHandle":null,"tagline":"Senior PFE, Microsoft ","bio":"Sourabh Agarwal currently works as a Senior Premier Field Engineer at Microsoft, specializing in proactive and advisory consulting assistance for SQL Server environments. As part of the Microsoft India Services Team, he has worked on SQL Server environments for leading corporations in various business domains, helping them to design, deploy and support for mission and business-critical applications. Apart from his daily work with customers, Sourabh owns SQLUninterrupted.com and is a frequent speaker at various SQL Server community events.","headshotUrl":"http://teched2013.blob.core.windows.net/images/4625c894-f72b-4fb1-8ec1-eac74a2830da","photo":null},{"id":"b4893c3c-7563-4d9e-9563-9c3da5017175","name":"Harsh Chawla","twitterHandle":null,"tagline":"PFE, Microsoft India","bio":"Harsh Chawla is working as a SQL server PFE with Microsoft. I learn and deliver, how to bring more business value out of SQL server, in my current experience. My core area of expertise is SQL server Performance Tuning and Optimization. I also love to interact with SQL community through MSDN forums and my blog http://dbcouncil.net/.","headshotUrl":"http://teched2013.blob.core.windows.net/images/a92bf506-23fb-48fd-8968-08c6c3416385","photo":null}],"begins":"2014-11-06T17:00:00","ends":"2014-11-06T17:55:00","location":"Magadh 2","Trackid":"3ed6a267-6b27-4dcd-b191-77cc558efc7e","TrackName":"Business Intelligence"},{"id":"3c1c1119-b4ca-4c79-a269-62be31323a32","title":"Azure Search","Abstract":"Azure Search is a new Azure service offered as search-as-a-service solution (currently in preview). This session will give a quick overview of its capabilities and how to quickly start using it. This session will also demonstrate a few widely used search scenarios like Making the search available on unstructured content, Making the search available on relational databases, Facets / Refiners.","speakers":[{"id":"877d6632-19a1-43cc-821e-c89594bca6f4","name":"Avneesh Kaushik","twitterHandle":null,"tagline":"Principal Consultant, Microsoft India","bio":"Avneesh Kaushik is a Principal Consultant with Microsoft Consulting Services having more than 15 years of experience in the Software Industry in areas of Enterprise strategy, Consulting, Software design & Architecture, Project Management etc. He is a certified Project Management professional experienced in full life-cycle application development and TOGAF 9. His vertical experience across the Software Industry covers areas like Health-care, e-Commerce, IT Training, Transportation etc. Avneesh has a wide range of experience in distributed computing, being part of team executing large scale distributed applications for industries such as health-care and Airlines. He is currently involved in Design and architecting multiple cloud Hybrid solutions based on Azure and O365 platforms. Avneesh was also a member of SharePoint Rangers group which includes MCS consultants (around 10 in the world) with deep knowledge of Microsoft SharePoint Products & Technologies and who work closely with Portal Product Management, Program Management, and the field to remove deployment barriers.","headshotUrl":"http://teched2013.blob.core.windows.net/images/d850466c-9962-465f-a2d0-c2da942f8121","photo":null},{"id":"358074d6-4c9e-4a4b-9ed6-8f3e7e90a14c","name":"Hemant Kathuria","twitterHandle":null,"tagline":"SR. Consultant, MCS, India","bio":"Hemant Kathuria is a Senior Consultant with Microsoft Consulting Services with more than 14 years of experience in the software industry in areas of enterprise strategy, consulting, software design & architecture, project management, etc. Hemant has extensive experience in distributed computing as part of the team that executes large scale distributed applications for industries such as land records, online retail and training management. He has also worked on deep search based implementations using FAST and SharePoint, and has delivered India’s biggest search implementation at a major IT company.","headshotUrl":"http://teched2013.blob.core.windows.net/images/929caeba-eae6-4ed2-86ec-0e58d66f7f22","photo":null}],"begins":"2014-11-05T14:45:00","ends":"2014-11-05T15:40:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"},{"id":"0e8fa448-95ab-4b3a-a4fc-69c6b5dfdf8e","title":"Best Practices and Notes from the Field - SCCM 2012 R2","Abstract":"Join us to learn best practices on how to get the best pot of your SCCM 2012 R2 deployments. Learn how to architect the topology for best results. Tips & tricks for OS deployment to patch management to Application management & much more.","speakers":[{"id":"8d94bb8d-3367-445c-b1ee-5f62c627ca62","name":"Adnan Ezzi","twitterHandle":null,"tagline":"Consultant, MSGD Microsoft India","bio":"Adnan is a Consultant with Microsoft Global Delivery (India) Pvt. Ltd. He has more than 12 years of experience in infrastructure planning, deployment, operations, and support services. He is highly proficient in Microsoft Infrastructure Platforms, System Center Suite of Products and Microsoft’s Cloud solutions. During the last few years with Microsoft Services Team, he has worked on System Center – Configuration Manager, Operations Manager, Service Manager, Orchestrator, VMM 2012 extensively supporting enterprise customers and Partners across the globe. He is a certified in several Microsoft technology certification amongst a host of other certifications. He enjoys participating in speaking about opportunities on IT Infrastructure automation and processes.","headshotUrl":"http://teched2013.blob.core.windows.net/images/b73c9d12-0c7e-4672-8b44-7e20e744551d","photo":null},{"id":"64fbb3a0-e586-481a-b296-50761a19145b","name":"Rohit Goel","twitterHandle":null,"tagline":"Consultant, MSGD Microsoft India","bio":"Rohit is a Consultant with Microsoft Global Delivery (India) Pvt. Ltd. He has more than 12+ years of IT experience in infrastructure designing & deployments . He is highly proficient in Microsoft Infrastructure Platforms, System Center Suite of Products, Corporate Image Engineering & Deployments. During the last few years with Microsoft Services Team, he has worked on System Center – SharePoint Migration , Virtualization, SCVMM 2012, Configuration Manager, MDT He is a certified in several Microsoft technology certification amongst a host of other certifications.","headshotUrl":"http://teched2013.blob.core.windows.net/images/cdf95dca-3eed-430e-9825-0d92bc6ab44a","photo":null}],"begins":"2014-11-06T16:00:00","ends":"2014-11-06T16:55:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"4af4e703-8e04-4ee9-9e5d-6a80693f679c","title":"Cloud Integrated Backup: Protect your Microsoft Workloads on Hyper-V, VMWare and Azure with SC DPM and Azure Backup","Abstract":"Join us to understand how System Center DPM and Microsoft Azure Backup are stepping up to address the challenge customers face whether it is about protecting large scale cloud deployments or it is about protecting Workloads in the Cloud. We shipped Hyper-V backup at private cloud scale for both Hyper-V over CSV and Hyper-V over SOFS. Continuing the Cloud-first approach, we plan to deeply integrate DPM and Azure Backup to protect all workloads to Azure, extend retention range up to 99 years in Azure (currently it is limited to 120 days), protect a heterogeneous cloud environment (by supporting Microsoft workloads running on VMWare) etc.Another new and key investment area that we are driving includes protection of workloads that are running in Azure. This is an interactive session where we want MVPs to participate, provide feedback and share best practices in the area of cloud integrated backup","speakers":[{"id":"c4ceb4aa-abfb-4227-9836-e2e40a26622e","name":"Viswanath Tata","twitterHandle":null,"tagline":"Sr Program Manager, Microsoft India  ","bio":"Viswanath Tata has 12 years of experience in the Technology Industry working predominantly in Networking, and Storage domains. Viswanath is with Microsoft for the last 2 years and has been working on Microsoft’s Backup products, which includes Windows Server Backup, Azure Backup and SC Data Protection Manager. Prior to Microsoft, Viswanath worked at EMC and Analog Devices as Senior Software Engineer. Viswanath has Masters in Computer Engineering from Clarkson University, USA and Bachelors in Electrical Engineering from Andhra University.","headshotUrl":"http://teched2013.blob.core.windows.net/images/961d1846-b6b7-4dd3-995f-12394f7d84e0","photo":null},{"id":"fbb760dd-c3e5-4e08-b2f0-4c94779bf447","name":"Manu Jeewani","twitterHandle":null,"tagline":"Senior Test Lead, Microsoft India ","bio":"Manu Jeewani has joined Microsoft around 9 years back and has worked on various Microsoft teams from Networking to Windows Security to Data Protection Manager. He works as Senior Software Lead in Data Protection Management (DPM) team which has the charter of providing best of breed backup of Microsoft workload running on any cloud or any workload running on Microsoft clouds. Manu is recently relocated from Microsoft Redmond to Microsoft India. Manu is an avid runner who has Bachelor of Technology (Computer Science) from Institute of Engg. and Tech (IET), Lucknow.","headshotUrl":"http://teched2013.blob.core.windows.net/images/02858a4b-89e5-483e-befa-9d603d455542","photo":null}],"begins":"2014-11-05T18:05:00","ends":"2014-11-05T19:00:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"0be91b3e-012e-478c-9e78-6bad81e734e4","title":"SQL Performance: Demystified in Azure VMs","Abstract":"This session will give an overview of how to harness the power of Microsoft Azure Virtual Machines for SQL Server database. A few tips and tricks is all it requires to keep a SQL Server database healthy on an Azure Virtual Machine. What’s more, we will even slip in few tricks to automate the entire deployment with the performance best practices enabled.","speakers":[{"id":"f386d180-35c3-4a57-b57f-d2dcbc580522","name":"Amit Banerjee","twitterHandle":null,"tagline":"Sr PFE, Microsoft India","bio":"Amit Banerjee currently works as a Senior Premier Field Engineer at Microsoft, specializing in proactive and advisory consulting assistance for SQL Server environments. In the past, he was part of the SQL Server Escalation Services team at Microsoft. He has worked on SQL Server environments for leading corporations in various business domains, helping them to identify and rectify SQL Server-related issues for mission and business-critical applications. Apart from his daily work, he owns TroubleshootingSQL.com and is a frequent speaker at various SQL Server community events and has contributed to tools like SQL Nexus and SQL Server Backup Simulator.","headshotUrl":"http://teched2013.blob.core.windows.net/images/0482def3-5247-418d-bbcf-3984555aba9d","photo":null},{"id":"a84fc534-3eda-4df1-a84d-67e6ab748ca2","name":"Sourabh Agarwal","twitterHandle":null,"tagline":"Senior PFE, Microsoft ","bio":"Sourabh Agarwal currently works as a Senior Premier Field Engineer at Microsoft, specializing in proactive and advisory consulting assistance for SQL Server environments. As part of the Microsoft India Services Team, he has worked on SQL Server environments for leading corporations in various business domains, helping them to design, deploy and support for mission and business-critical applications. Apart from his daily work with customers, Sourabh owns SQLUninterrupted.com and is a frequent speaker at various SQL Server community events.","headshotUrl":"http://teched2013.blob.core.windows.net/images/4625c894-f72b-4fb1-8ec1-eac74a2830da","photo":null}],"begins":"2014-11-05T18:05:00","ends":"2014-11-05T19:00:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"1de90025-1d1d-40f4-a39b-6bd446f32e99","title":"How is SQL Server being used on Windows Azure Virtual Machine?","Abstract":"We keep hearing: “What can be done in Azure SQL database.” How about: “What cannot be done?”","speakers":[{"id":"9661544a-b4b2-453b-810f-fd4b9fcf2a13","name":"Vijay Rodrigues","twitterHandle":null,"tagline":"Support Escalation Engineer, Microsoft India \t","bio":"Vijay has worked on SQL Server in the areas of engine, connectivity, replication, clustering, AlwaysOn Availability Groups, In-Memory OLTP, related Windows Azure IaaS and PaaS issues, and related TSQL and PowerShell issues. These involved deployments from few users to deployments with critically impacted millions of users. He is currently working as Support Escalation Engineer in the SQL Server team (AlwaysOn, Azure specialty) with Microsoft India GTSC.","headshotUrl":"http://teched2013.blob.core.windows.net/images/54e4668a-61e4-4f65-b886-5caff83a77ee","photo":null}],"begins":"2014-11-06T16:00:00","ends":"2014-11-06T16:55:00","location":"Magadh 2","Trackid":"3ed6a267-6b27-4dcd-b191-77cc558efc7e","TrackName":"Business Intelligence"},{"id":"f7c55948-196c-44ee-a338-73ad4a528557","title":"Building Universal apps on Windows platform","Abstract":"Truly Mobile apps are just not limited to phone applications, they should across all devices (be it your desktop, laptop , phone, your car and even your TV). Join this session if you would like to build an app which runs everywhere while you write the code only once. Windows 8.1 takes a big step towards enabling mobile apps by introducing universal apps. Universal app enable building applications on the converged Windows 8.1 and Windows Phone 8.1 platforms and very soon Xbox as well. Join this session for a walk through of building an application for both Windows and Windows Phone using Html/JS and Xaml/C#.. Along the way you'll learn about how Visual Studio Universal projects help you easily share code between your applications and also help you build differentiated experiences.","speakers":[{"id":"60d64f1a-f6e9-41e2-a923-f39a8dc583cf","name":"Aditee Rele","twitterHandle":null,"tagline":"Technical Evangelism Manager, Microsoft India","bio":"Aditee has worked extensively with enterprise customers in India and Abroad, architecting and designing large scale enterprise solutions on Microsoft Stack with specific expertise in the Retail, Pharma and Manufacturing domain for the last 15 yrs. At Microsoft, Aditee leads technical evangelism for Microsoft India and is responsible for driving adoption of Microsoft products & technologies for Devices, Apps and Cloud. In her role, she works with the developer ecosystem to help them build world-class solutions on the Microsoft Stack. In addition, she also works with large enterprises, small business, start-ups and ISV’s to provide strategic and technical guidance to them realize the potential of mobility and cloud for their businesses to fuel innovation. Aditee is a proponent of women in technology and is passionate about helping women build and sustain long term careers in IT and also provide a platform for Women to be successful in their Entrepreneurial journey. You can follow her on twitter @aditeerele","headshotUrl":"https://teched2013.blob.core.windows.net/images/c9f9172d-6f14-4f4b-bd2f-94f48a0b8a9b","photo":null}],"begins":"2014-11-05T10:45:00","ends":"2014-11-05T11:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"a58a42ce-8672-4ae5-9b35-79b8d63f6a87","title":"Office 365 Security, Privacy and Compliance","Abstract":"Security, Privacy and Compliance are top of mind for customers considering the cloud or moving to the cloud. This session will help you understand the fundamentals that guide Office 365 to ensure customers data is kept secure, private and compliant with industry standards and regulations. You will learn about the service level aspects of security, privacy and compliance in Office 365 and customer controls that we provide to enable customers to tailor your environment in Office 365.","speakers":[{"id":"7d972be8-2e27-47c3-85eb-9fcc69dc3b52","name":"Randhir Dhawan","twitterHandle":null,"tagline":"Technology Specialist, Microsoft India","bio":"Randhir Dhawan is a Technology Specialist at Microsoft India. He works with customers to help them evaluate, deploy Communication & Collaboration solutions. He has 10+ years of experience in customer consulting around Cloud Computing, Enterprise Telephony & Collaboration Solutions.","headshotUrl":"http://teched2013.blob.core.windows.net/images/e8d874f8-8068-4dbe-a010-661ae1c170dd","photo":null},{"id":"55d268b8-6d13-4574-be85-bc6eb461a850","name":"Gurmeet Singh","twitterHandle":null,"tagline":"Sr Technology Specialist, Microsoft India","bio":"Gurmeet Singh is a Senior Technology Specialist in Enterprise & Partner Group (EPG) at Microsoft India. He has 15+ years of experience in building solutions on Cloud Computing, Enterprise Information Portal, Content Management, Enterprise Search, Collaboration & Business Intelligence Solutions on Microsoft Platform, handling major enterprise customers of Microsoft in North India. He has worked with customers in multiple industries including financial (banking and insurance), manufacturing, telecommunications, petroleum, pharmaceuticals and government.","headshotUrl":"http://teched2013.blob.core.windows.net/images/e5158710-e6cc-40c3-a747-e04bc12a38a4","photo":null}],"begins":"2014-11-06T14:45:00","ends":"2014-11-06T15:40:00","location":"Magadh 1","Trackid":"61e1822f-1059-4020-bdb3-5c88e7d2f6f4","TrackName":"Online Services"},{"id":"cb17db50-c1fb-4e9e-a108-7e03a7e22766","title":"Architecting realtime and responsive applications on Azure","Abstract":"Discuss scenarios, design decisions around using service bus, Virtual networks and WFC to create highly responsive applications on Azure.","speakers":[{"id":"cf4bacab-6790-4b26-a1b1-c4aa5f7161c6","name":"Girish Phadke","twitterHandle":null,"tagline":"Head – Microsoft COE, TCS","bio":"Girish has over 20 years of IT experience with a focus on Microsoft Technologies and industry domains such as TTH, telecom, BFSI, healthcare, retail and energy. He has a Bachelor of Engineering (Computer Technology) from Maulana Azad National Institute of Technology, Bhopal. As a Microsoft Certified Solutions Architect, he has led solution architecture development in a $100 million retail banking initiative for a large bank in the USA. He has also led solution architecture development on .NET Framework for a Healthcare Product Company in USA. Girish has filed a patent for Capacity Planning Methodology for .NET Applications. As an expert he has conducted a session on Identity Management for Architects for Microsoft Virtual Technology Days. He has also published a technical paper on WCF Security on MSDN along with Microsoft Product Development Team (http://msdn.microsoft.com/en-us/library/bb875951.aspx). Girish has several webcasts on architectural topics for Microsoft to his credit – these are published on Microsoft Wordwide Events Portal. (https://msevents.microsoft.com/CUI/WebCastEventDetails.aspx?EventID=1032353927&EventCategory=5&culture=en-IN&CountryCode=IN)","headshotUrl":"http://teched2013.blob.core.windows.net/images/df751ded-61b1-48bd-a0f8-cc14b9a50ee2","photo":null},{"id":"eb30f51f-ec3a-4e05-92f8-69ca39865474","name":"Maneesha Marathe","twitterHandle":null,"tagline":"Solutions Architect – Microsoft COE, TCS","bio":"Maneesha has over 15 years of IT experience with a focus on Microsoft Technologies and industry domains such as Manufacturing, Insurance, Healthcare and Hospitality Management. She has led solution architecture for several projects in manufacturing domain including automotive and aerospace manufacturing customers. Additionally, she has also led solution architecture for a healthcare product company in the US. Maneesha is a Microsoft Certified Professional and TOGAF certified Architect.","headshotUrl":"http://teched2013.blob.core.windows.net/images/2e118671-fc0c-4d61-b660-17bf53a3385a","photo":null}],"begins":"2014-11-06T11:45:00","ends":"2014-11-06T12:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"96384542-c3d2-49cc-9fcc-81a9f720a79a","title":"Nuts & Bolts of Networking on Azure","Abstract":"While Cloud is quick & flexible, to get the best control on the environment deployed on Azure – understanding of networking is a must. In this session, will cover the “must know networking concepts” to run VMs on Azure. Join in to understand the scenarios, opportunities & learn about of recent enhancements on Azure networking like Multi-site VPN, Express route etc.","speakers":[{"id":"328c12df-7ad3-477b-9377-f1a489cbd373","name":"Pracheta Budhwar","twitterHandle":null,"tagline":"Technology Evangelist, Microsoft","bio":"Pracheta has been in the IT industry for 11 years & currently works as Technology Evangelist at Microsoft. In her current role, she leads the IT Professional evangelism charter for the subsidiary. With a rich background of providing technology and architectural guidance to Enterprise customers, she has worked on products relating to Windows Server family right from NT days, Exchange Server, System Center and Lync Server to latest developments on Virtualization, Private Cloud & recently Microsoft Azure. Pracheta has been in a quite a few roles like infrastructure management, pre-sales & consulting. She’s a regular speaker at Microsoft events and other industry tech summits. She is also an avid reader, a novice writer and an enthusiastic traveler. Pracheta blogs at http://blogs.technet.com/pracheta & tweets at @prachetab.","headshotUrl":"http://teched2013.blob.core.windows.net/images/4d5d1f66-ae9a-43e8-9b66-681abd74e644","photo":null}],"begins":"2014-11-06T14:45:00","ends":"2014-11-06T15:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"4e2a29df-de65-4481-9770-826a32fd2de5","title":"Modern Web Application on Microsoft Technologies","Abstract":"Leverage the new features on the Microsoft Platform such as Owin, SignalR, AngularJS, Redis, ServiceBus, GraphDB to build powerful web applications Full Description: Today building RDBMS driven web applications are a thing of the past. Single Page web applications driven by NoSQL database is the new realm that web developers are embracing like no other. Leverage the new Microsoft Web Platform to take advantages of these new capabilities and build powerful web applications. This session will focus on single page web application architecture using Owin, SignalR and AngularJS. We'll also show how you can use Redis and ServiceBus as the middle tier to power the web application. We will also talk about the GraphDB and how it can deliver new user experiences through the web application.","speakers":[{"id":"9da2b38d-5b75-4b2d-997d-b9c100ce228a","name":"Anil Dwarakanath","twitterHandle":null,"tagline":"Cloud Solution Architect, MCS India","bio":"Anil Dwarakanath is a Cloud Solution Architect at Microsoft. He has architected and delivered complex solutions hosted on on-premise and Windows Azure, cutting across Dynamics CRM, SharePoint and SQL Server BI. Previously he has worked in Core Banking and Credit Cards domains and has been part of High Availability Command Center operations deploying technical solutions in these areas. He is a Microsoft Certified Solutions Specialist in SharePoint and Windows Azure.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9a148bbf-a19f-440e-ba64-1ba1f51c05f1","photo":null}],"begins":"2014-11-06T14:45:00","ends":"2014-11-06T15:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"6d34b71d-c03b-4417-941d-82c5918498c9","title":"Migrate your workloads to Microsoft Azure using the Microsoft Migration Accelerator","Abstract":"Introducing Microsoft Migration Accelerator (MA), designed for seamless migration of any customer workloads into Microsoft Azure. Please join this session to learn how MA works, and see a demo of migration of on-premises multi-tier complex applications (e.g. a SharePoint farm) into Azure in minutes with few clicks on a web portal, and with minimal down-time to production.","speakers":[{"id":"5d27a296-123e-410c-b739-d8bab5e20714","name":"Srinath Vasireddy","twitterHandle":null,"tagline":"Principal Lead Program Manager, Microsoft India","bio":"Srinath Vasireddy is a Principal Program Manager working on the newly acquired InMage team, part of Azure Site Recovery. He is currently responsible for delivering Microsoft Migration Accelerator (for Azure). Prior to that, he managed Windows Azure Backup. He has experience on a broad range of domains and has worked in various Microsoft teams including Microsoft Live Labs Research, Developer Division and Patterns & Practices.","headshotUrl":"http://teched2013.blob.core.windows.net/images/d227d7d6-f336-4d49-99ab-d18b53fe6cca","photo":null}],"begins":"2014-11-06T16:00:00","ends":"2014-11-06T16:55:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"2eaf5a8f-dd8b-417e-aad5-83baec2b1f52","title":"Welcome Note","Abstract":null,"speakers":[{"id":"af804719-dd38-48b6-80c1-6befc814835b","name":"Joseph Landes","twitterHandle":null,"tagline":"General Manager, Developer Experience &amp; Evangelism, Microsoft India ","bio":"Joseph is a 17 year veteran of Microsoft and has been in a variety of roles both in Sales & Marketing and Business Groups. These include 5 years in OEM Sales, 5 years with Server and Tools and a stint in Europe as the Server Business Group Lead in Central and Eastern Europe. Joseph led the biggest IT Pro and Developer launch in the history of Microsoft with the ‘Heroes Happen Here' launch of Windows Server 2008, SQL Server 2008, and Visual Studio 2008. Joseph is an avid reader and sports fan, and is looking forward to visiting every state and union territory in India.","headshotUrl":"http://teched2013.blob.core.windows.net/images/faecd774-287a-449b-bb26-f4573a53b43f","photo":null}],"begins":"2014-11-06T09:30:00","ends":"2014-11-06T09:40:00","location":"Kalinga 1","Trackid":"f446cc16-0e92-4ade-9f43-b74528948b89","TrackName":"Keynote"},{"id":"5cb7a9a0-9501-4f75-b0da-866d550affc2","title":"ASP.NET vNext and Visual Studio 14","Abstract":"What does ASP.NET look like in 2014 and beyond? In a world of NuGets and modular frameworks, of lightweight VMs, how could ASP.NET change and get faster, leaner, meaner, and more. The session will introduce you to ASP.NET vNext and Visual Studio 2014 and thinking and design around ASP.NET vNext","speakers":[{"id":"f6b13f3b-66e9-487c-88da-b79cffdd38e0","name":"Puneet Gupta","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft ","bio":"Puneet is an Escalation Engineer with the Developer Support Internet team in Microsoft and has been supporting IIS and ASP.NET for more than nine years. Currently, he supports Microsoft Azure Websites. He is SME on IIS, ASP.NET, COM, COM+, Web Services, WCF and App-Fabric. He is a debugging ninja and possesses strong troubleshooting skills for all Microsoft web based developer technologies. He is a developer with the team that built the Debug Diagnostic tool, which developers and IIS administrators use to troubleshoot performance and crash issues in web applications. He has also delivered sessions in Azure Conference and GIDS recently.","headshotUrl":"http://teched2013.blob.core.windows.net/images/4be6428e-b5a6-4c1a-9d7b-1deaef166231","photo":null},{"id":"d94c8ffa-89b0-409b-877b-5dfc556429d5","name":"Nazeef Mallick","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft ","bio":"Nazeef is an Escalation Engineer with the Developer Support Internet team at Microsoft and has been supporting ASP.NET for more than 8 years. He is an expert on Windows Internals and TCP protocol analysis, and solves technically challengingand business-critical issues forMicrosoft customersandpartners. He has also delivered workshops and training on Windows Debugging and ASP.NET MVC to Microsoft Premier Customers.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9f0683eb-83a1-4f18-aa24-b18610fa82ac","photo":null}],"begins":"2014-11-06T10:45:00","ends":"2014-11-06T11:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"521154e9-b4fe-4208-8a0c-886db9586989","title":"Go Mobile with C#, Visual Studio, and Xamarin","Abstract":"Xamarin enables C# developers to become native iOS, Android, and Windows mobile app developers overnight. In this session, learn how to leverage your existing Microsoft .NET and C# skills to create iOS and Android mobile apps in Visual Studio with Xamarin. In addition to allowing you write your iOS and Android apps in C#, Xamarin lets you reuse existing .NET libraries and share your business logic across iOS, Android, and Windows apps. This session also gives you the tools to determine how much existing C# code can go mobile to iOS and Android, plus helps you determine the architecture necessary to support maximum code sharing and reuse. We also provide guidance and best practices for handling fragmentation across and within each device platform. During this session we will cover the Xamarin platform and how to create native iOS, Android, and Windows apps in C#. Moreover, we will really focus on the code with several live coding adventures throughout the entire session. When you leave you will have the knowledge to create your first iOS & Android in C# with Xamarin in Visual Studio","speakers":[{"id":"6b087758-9fdc-4062-afcd-a8c9efcf49b4","name":"Nish Anil","twitterHandle":null,"tagline":"Developer Evangelist, Xamarin","bio":"Nish is a C# fanatic and has been writing softwares for web & windows platforms for almost a decade now.He is Xamarin's first Developer Evangelist for India and a Microsoft MVP in Visual C#.He works out ofBangalore, India and is passionate about spreading C# & Xamarin love by helping developers build 100% native mobile applications for iOS, Android, Windows Phone & Windows Store Apps.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c5579cb7-1ab8-4a4e-9342-2bd44bd4a66b","photo":null}],"begins":"2014-11-05T13:45:00","ends":"2014-11-05T14:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"93e2e2a6-531f-4986-915e-8c39320e027d","title":"MTC Learnings from ISV and Enteprise engagements","Abstract":"This session will summarize MTC learnings across Data and Cloud platforms which challenged us. The intent of the session is to share what works and what compromises we need to take while choosing a datastore (relational vs non-relational), lookup(cache vs search vs database), ingestion (EventHub vs use your own), analysis of data (Machine learning vs regular analysis). This session will also cover adaptation in the architecture principles and patterns while adopting cloud. We will cover what does not work in public cloud and how to overcome them","speakers":[{"id":"414482b9-2345-4ec0-91ff-2bd8cd40fe34","name":"Govind Kanshi","twitterHandle":null,"tagline":"Technical Director- MTC, Microsoft India","bio":"Govind is the Technical Director at the Microsoft Technology Center (MTC) at Bangalore. Govind manages the various technology practices at MTC and is especially focused on Azure Guidance practice. Having very deep technical experience with SQL Server he is always intrigued by SQL Azure and its capabilities and applications. Over the past year, he has successfully helped customers migrate to Microsoft Azure. Govind has over 20 years of experience of which he has been with Microsoft for more than 10 years.","headshotUrl":"http://teched2013.blob.core.windows.net/images/6fc08379-91c4-4a62-9d60-d938f3779f2a","photo":null}],"begins":"2014-11-06T13:45:00","ends":"2014-11-06T14:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"28a6f893-e473-46dc-8bcb-8eb4388f6c71","title":"Microsoft Azure Redis Cache","Abstract":"Microsoft Azure Redis Cache is a dedicated cache service from Microsoft, based on the OSS Redis Cache engine. In this session we will firstly introduce users to Redis and the features it offers. Next we will talk about the architecture of the Azure Redis Cache Service and dwell into the capabilities that it offers in addition to basic Redis hosting. Lastly, we will review end to end real world scenarios leveraging Redis Cache in conjunction with other Azure services.","speakers":[{"id":"eeb18f3a-bdc9-456a-997a-0da102e5bdda","name":"Angshuman Nayak","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft India","bio":"Angshuman is a part of the Cloud Integration Engineering team at Microsoft. This role requires consulting, advising and supporting Microsoft customers using Windows Azure platform for their business applications. His areas of expertize are around Windows Azure PAAS, Service Bus, ACS, Cache, SQL Azure and Data Access. He also specializes in debugging and troubleshooting cloud deployments. He currently helps developers adapt to Windows Azure PAAS. He has over 9 years of experience in the IT Industry. Prior to Microsoft, Angshuman worked for a major Indian IT service firm primarily designing and developing applications in the BFSI space. He blogs at http://blogs.msdn.com/cie.","headshotUrl":"http://teched2013.blob.core.windows.net/images/201c01ec-6322-498c-aa1e-e5e10c09c904","photo":null},{"id":"f75c6288-0d47-4e85-92d9-2f4942296deb","name":"Pradeep Kumar C","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft India","bio":"Pradeep is an Escalation Engineer from Microsoft CSS Cloud Integration Engineer [CIE] team with more than 14 years of experience in various Microsoft Products and Technologies. He has been working with Microsoft CSS Team for the last 10 years in supporting various Microsoft Products and technologies. For the last four years, He had been supporting Windows Azure PaaS technologies and also actively engaged with the Microsoft Azure Product Group. Pradeep is a regular speaker at Microsoft Internal technical events, and blogs at http://blogs.msdn.com/cie.","headshotUrl":"http://teched2013.blob.core.windows.net/images/f0b88ae3-ef5c-4752-8d45-22a05b220338","photo":null}],"begins":"2014-11-05T14:45:00","ends":"2014-11-05T15:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"eb751e9c-a881-4ee3-8321-8ed1d9bfd30b","title":"Microsoft Azure SQL Database Overview","Abstract":"Come to this session to learn about the latest investments in Azure’s relational database-as-a-service, SQL Database. We will demonstrate the value proposition of SQL Database with Basic, Standard and Premium service tiers and walk through enhancements in performance, scale out, business continuity and modern data developer & management experiences.","speakers":[{"id":"f9942a0b-8d64-4fac-a908-7772ce04c2a4","name":"Sanjay Nagamangalam","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft USA","bio":"Sanjay Nagamangalam is a Principal Group Program Manager in the SQL Server division where he helps create immersive developer and manageability experiences for SQL Server and Azure SQL Database in the Azure Management Portal, SQL Server Management Studio, SQL Server Data Tools and Visual Studio. Sanjay is very passionate about data developers. In previous roles at Microsoft, Sanjay was responsible for APIs and developer tooling experiences for the ADO.NET Entity Framework, the ADO.NET Entity Designer and WinFS. Prior to joining Microsoft, Sanjay lived in the Bay Area where he co-founded a technology consulting firm and served as VP technology in a leading online textbook retailer. Sanjay has also spent several years at Corel Corporation (Canada) where he headed the Corel WordPerfect and Corel Ventura development teams and shipped several successful releases of both products. Before Corel, Sanjay was Chief of R&D at a security company in Bangalore (India).","headshotUrl":"http://teched2013.blob.core.windows.net/images/06d370d6-2863-4a97-8ad1-b0ba075d9294","photo":null}],"begins":"2014-11-05T10:45:00","ends":"2014-11-05T11:40:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"12b71e20-ff1d-4e18-b451-8f5a5257ebba","title":"Visual Studio Ultimate Productivity Tools: What’s new in Dev12 updates and beyond","Abstract":"Come & learn about the new features in CodeMap, Debugger Map & CodeLens. These powerful productivity tools in Visual Studio Ultimate will allow developers to easily understand code, communicate its design with others and effectively understand team activity in the current development context.","speakers":[{"id":"a8e26d92-e717-4c7e-a43a-d80adeb10808","name":"Mathew Aniyan","twitterHandle":null,"tagline":"Senior Program Manager , Microsoft India","bio":"Mathew Aniyan is a Senior Program Manager in the Visual Studio ALM team responsible for the CodeLens feature. Mathew has been working with Microsoft for 7 years on various features in Visual Studio including Coded UI Test, Unit Test & Microsoft Test Manager. Before joining Microsoft, Mathew worked as a Project Manager in CSC. Mathew holds a Bachelor of Technology in Computer Science from NIT, Calicut. Mathew is an inventor of 2 US patents.","headshotUrl":"http://teched2013.blob.core.windows.net/images/44f89bfa-91eb-44a3-af9f-df89aabec777","photo":null}],"begins":"2014-11-06T10:45:00","ends":"2014-11-06T11:40:00","location":"Magadh 1","Trackid":"831a8122-fd75-4d93-a17e-2af292800ded","TrackName":"Dev Tools"},{"id":"ffdf9caa-f819-452a-993a-a15c7e63a996","title":"Azure Mobile Services - Deep Dive","Abstract":"Need to have a backend for your mobile app on any of platforms like iOS, Android or a windows app? Have it in less than few minutes with Azure Mobile Services. This session explores the features set of Azure Mobile Services focusing on Notifications, Offline Sync, Identity Management and Security.","speakers":[{"id":"65b7a51c-7a19-44a5-87c5-e8bf94f372ef","name":"Poonam Sampat","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft India","bio":"Poonam works as Technical Evangelist with Microsoft India. She has been in the industry for close to 13 years. She has spent considerable amount of her time with Microsoft technologies, in her earlier stints with Goldman Sachs, Keane and other organizations.Poonam is passionate about helping customers on-board Microsoft Azure.","headshotUrl":"http://teched2013.blob.core.windows.net/images/7663e802-28b0-429b-9a76-142c629ef69a","photo":null},{"id":"015f6e21-5382-4ed2-b78f-51e30bb96eaf","name":"Ruhani Arora","twitterHandle":null,"tagline":"Technology Evangelist, Microsoft India","bio":"Ruhani is a technology enthusiast, who works with Microsoft India as a Technical Evangelist. Her role at Microsoft includes working with depth customers, students and developers to help them build Windows apps powered by Azure A computer engineering graduate from Netaji Subhas Institute of Technology, Delhi University, Ruhani is an avid reader and loves to keep abreast with the latest technological developments around the globe.","headshotUrl":"http://teched2013.blob.core.windows.net/images/7c91f1e6-0b7e-4e9d-b352-6bde1ff3a246","photo":null}],"begins":"2014-11-05T11:45:00","ends":"2014-11-05T12:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"0ff36c9b-56a3-4700-8420-a4eee016ce81","title":"Cloud media solutions using Azure Media Services","Abstract":"In this session, you will learn a practical approach to building high scale backends for mobile games targeting multiple client platforms including iOS, Android, Windows Phone and Windows 8. The session will be focused on showcasing single sign on, storage and compute for implementing leaderboards and skill matching players in online multiplayer games. Come join the session to learn how developers can reduce costs and achieve turnkey scalability with Windows Azure.","speakers":[{"id":"e8bbfd5e-9c2f-4e82-b2e6-b77723e3326a","name":"Juan Pablo Garcia Gonzalez","twitterHandle":null,"tagline":"Senior Technical Evangelist, Microsoft","bio":"Juan Pablo Garcia Gonzalez is a Senior Technical Evangelist working in the Technical Evangelism and development team (TED Americas). He works as a technical expert on Azure platform working with a primary focus on CSVs in America. In the recent months, he has worked on many Azure Media Services projects. Juan Pablo is an electronic engineer with a master’s degree and broad experience in cloud computing.","headshotUrl":"http://teched2013.blob.core.windows.net/images/5ddc7891-37ee-4bc8-9882-4c2750aa5eb4","photo":null},{"id":"9d8a9fb5-dbce-4dc7-9415-dfe21cc2cfbe","name":"Shweta Gupta","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft","bio":"Shweta is a Senior program manager in Microsoft, who specializes on Azure. Her expertise lies in enabling, building and migration of big data workloads onto Azure, focusing on re-architecting for short term as well as long term. With over nine years of work experience in various Microsoft technologies, Shweta is now associated with Azure since the last three years. Shweta has a computer applications background with an MBA in Finance. In the past she has written papers and spoken at several international conferences on application of information technology in the financial reporting domain.","headshotUrl":"http://teched2013.blob.core.windows.net/images/54bbef47-705f-4bad-84e9-aa3e7ca8a573","photo":null}],"begins":"2014-11-05T10:45:00","ends":"2014-11-05T11:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"5314b12a-8e92-49dd-b6bc-a682af90565f","title":"Availability for the Modern Datacenter","Abstract":"Virtualization has become a cornerstone of the modern datacenter, with Hyper-V technologies bringing new capabilities to the game. The requirements for availability became higher than ever with Always-On Business being the new operational standard. In this session, learn how to insure data loss avoidance, recover just what you need with multiple high-speed restore options, leverage backups/replicas to get a test environment without additional investment, and gain visibility of your backup infrastructure.","speakers":[{"id":"26d8d511-24d2-47ea-9ed9-14e17e5ca6d8","name":"Alexey Strygin","twitterHandle":null,"tagline":"Director of Technical Operations in Emerging Markets and LATAM, Veeam Software\t","bio":"Alexey is managing the Technical Operations department at Veeam Software.With 13 years of experience in IT Alexey spent the last 5 years at Veeam Software helping the organizations to adopt the Modern Data Protection and Datacenter Management technologies. Alexey have been highly focused with Microsoft System Center products and workedwith the largest enterprise IT infrastructures across Europe and the Middle East.Additionally, he presents on many occasions at large events like MMS, Tech Days and TechEd.","headshotUrl":"http://teched2013.blob.core.windows.net/images/36733c63-4cc0-47ed-9d01-a569488462e7","photo":null}],"begins":"2014-11-06T17:00:00","ends":"2014-11-06T17:55:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"6f302c97-9747-42bc-8b91-a699e72026c3","title":"Using Auditing and Azure Automation with Azure SQL Database","Abstract":"As developers look to move their on-premise workloads to Azure’s relational database-as-a-service, SQL Database, they often ask about how Auditing, Automation and Maintenance of these workloads will work in a cloud-first world. Join us to learn more about two new preview capabilities in Azure: Auditing in Azure SQL Database and using Azure Automation to automate, monitor and maintain Azure SQL Database.","speakers":[{"id":"f9942a0b-8d64-4fac-a908-7772ce04c2a4","name":"Sanjay Nagamangalam","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft USA","bio":"Sanjay Nagamangalam is a Principal Group Program Manager in the SQL Server division where he helps create immersive developer and manageability experiences for SQL Server and Azure SQL Database in the Azure Management Portal, SQL Server Management Studio, SQL Server Data Tools and Visual Studio. Sanjay is very passionate about data developers. In previous roles at Microsoft, Sanjay was responsible for APIs and developer tooling experiences for the ADO.NET Entity Framework, the ADO.NET Entity Designer and WinFS. Prior to joining Microsoft, Sanjay lived in the Bay Area where he co-founded a technology consulting firm and served as VP technology in a leading online textbook retailer. Sanjay has also spent several years at Corel Corporation (Canada) where he headed the Corel WordPerfect and Corel Ventura development teams and shipped several successful releases of both products. Before Corel, Sanjay was Chief of R&D at a security company in Bangalore (India).","headshotUrl":"http://teched2013.blob.core.windows.net/images/06d370d6-2863-4a97-8ad1-b0ba075d9294","photo":null},{"id":"3eac355c-93e6-4bf4-bf62-74fa8cad4435","name":"Sunil Kumar BS","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft India","bio":"Sunil is an Escalation Engineer working with SQL team. He have close to 10 years of experience at Microsoft working on SQL Developer and BI technologies. Sunil has been involved on publishing various tools for end users and general public consumption. He is an Expert in SQL BI and Data Access technologies with unique approach of troubleshooting highly complex issues and works directly with the SQL Product team on fixing these issues and product improvements.","headshotUrl":"http://teched2013.blob.core.windows.net/images/34d0c08a-7c1b-4d80-a42a-720363a56ece","photo":null}],"begins":"2014-11-06T13:45:00","ends":"2014-11-06T14:40:00","location":"Magadh 2","Trackid":"3ed6a267-6b27-4dcd-b191-77cc558efc7e","TrackName":"Business Intelligence"},{"id":"5073b880-0333-4e88-884f-a841fcb9e8ec","title":"Why & How Demystified – Internals of In-Memory OLTP","Abstract":"SQL Server 2014 bought new feature called In-Memory OLTP (code name: Hekaton). This is the most important new feature in SQL Server 2014, and this session will teach you how query processing and optimization work with this new component of database engine. Along with basics, we would also discuss and learn how to access memory-optimized tables using interpreted Transact-SQL, and how to optimize data access using the new natively compiled stored procedures. This feature uses new indexes called hash and range indexes. We will discuss them as well. We would conclude with some limitations with the current release of In-Memory OLTP.","speakers":[{"id":"f95110dd-0359-40ce-b529-ace383ad0c9a","name":"Balmukund Lakhani","twitterHandle":null,"tagline":"Support Escalation Engineer, Microsoft India","bio":"Balmukund is currently working with Microsoft SQL Server Support Escalation Services (AlwaysOn Specialty). During his 9 years long journey with Microsoft, he was also a part of Premier Field Engineering Team for 18 months. Prior to joining Microsoft in 2005, he worked as SQL developer, SQL DBA and also got chance to wear his other hat as a ERP Consultant in Ahmedabad. He is passionate for technology, learning and sharing his knowledge. He is an active blogger on www.SQLServer-Help.com to share his knowledge with world. He is a husband, father, author, blogger, mentor, speaker on SQL Server technologies and MSDN SQL forums moderator. He has spoken at various external events including TechEd (2011, 2012 and 2013), SQL Saturday and the Bangalore SQL User Group Meetings and provided internal trainings. He is also active forum member on Microsoft SQL Server forum. He loves helping others on issues related to SQL Server product via internal SQL Forums, MSDN forums and SQL Bangalore Facebook Group. He recently published a book on SQL Server 2012 AlwaysOn, which is the only book about single technology. He believes - \"there's a solution to every problem and a reason for everything”","headshotUrl":"http://teched2013.blob.core.windows.net/images/22fd91f8-f39c-4e85-8140-8891c199593e","photo":null}],"begins":"2014-11-05T11:45:00","ends":"2014-11-05T12:40:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"9f547f48-a736-4e9b-bb84-aa2e7ecaa275","title":"Riding the elephant using patterns for Azure for transformative architectures.","Abstract":"An architecture is a key driver of innovation in solutions and organizations. One of the key challenges in driving innovation is getting people to do things which they have never done before in life. This essentially means a transformation is needed for an innovation to happen. The most important ingredient to any transformation is people. As an architect how can we drive this transformation? How to operate from a position of disadvantage? Gamification is the application of game elements and digital game design techniques to non-game problems, such as business and social impact challenges. This talk will cover the mechanisms of gamification, why it has such tremendous potential, and how to use it effectively. Just like security , performance quality attributes how to view gamification elements as another quality attribute of architecture. Using Azure patterns how to make an architecture transformative and inclusive with these above concepts and technology coming together. So what is the deal of \"Riding The Elephant\" with all this, please come to the session to find out. Also,I will be sharing personal experiences from the field in which the above techniques worked","speakers":[{"id":"5d24d8eb-6cfc-4ce7-85d7-bf00028a4440","name":"Kumaran Anandan","twitterHandle":null,"tagline":"Architect, MCS - Microsoft India","bio":"Kumaran has twenty one years of leadership and hands-on experience in generating business value through the use of technology in domains of real-time industrial systems, banking, IT services, retail and manufacturing. Kumaran has successfully run his own software company for 3 years. His core focus is working with senior executives in business and IT to align technology with business goals in order to deliver business benefits. Kumaran is a Certified Architect (CITA-P) and a practicing PMP. He is also on the board of IASA certifications.","headshotUrl":"http://teched2013.blob.core.windows.net/images/8b87ca59-4b88-4525-a296-0c1571ed04d1","photo":null}],"begins":"2014-11-05T13:45:00","ends":"2014-11-05T14:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"b888fe0b-852d-4b25-be86-ac54b322ce9b","title":"Migrating your WP8 Silverlight App to WP8.1 RT","Abstract":"In this talk you would learn about the Migration path from WP SL, the API/ Namespace changes, while targeting Universal Apps/ Windows Phone Runtime Apps. Get to know the points to take care while migrating your WP8 Silverlight based App to WP8.1 RT with some short demos.","speakers":[{"id":"02a22d55-2fbb-41e6-a395-9a753c51fce7","name":"Goutham Upadhyaya","twitterHandle":null,"tagline":"PFE, Microsoft India","bio":"Goutham Upadhyaya is a Premier Field Engineer with Microsoft. He is having over 8 years of IT experience. He has been in a quite a few roles like Developer, pre-sales & consulting. His current role involves guiding customers and partners in adopting and implementing latest Microsoft technologies. His primary areas of expertise include Microsoft Azure, Asp.Net MVC, Silverlight, WPF, Windows Phone and Windows 8 App Development. He has also specializes on emerging technologies like Hybrid Apps, HTML 5, Web Matrix, LightSwitch, Web Api’s, Entity Framework and LINQ. A regular speaker at Microsoft events and other industry tech Summits. Inhissparetime,helikestoread,travelandspendtimewithhisfamily and friends.","headshotUrl":"http://teched2013.blob.core.windows.net/images/1d17cb60-dda7-43e1-a19f-4bcbff61b52d","photo":null},{"id":"137c9722-4b80-49f1-835f-a9fed40c8f63","name":"Anubhav Ranjan","twitterHandle":null,"tagline":"Consultant, Xamarin and Microsoft MVP","bio":"Anubhav Ranjan is a Microsoft MVP on Windows Platform Development. He is a Program Freak who loves coding and currently works as a Consultant at Xamarin.He is very much passionate about Coding and loves to develop Mobile Apps. As a consultant he helps C# Developers to take their Code across Platforms.","headshotUrl":"http://teched2013.blob.core.windows.net/images/191a33fc-c169-47c2-b070-a8324e051461","photo":null}],"begins":"2014-11-05T18:05:00","ends":"2014-11-05T19:00:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"61745b89-b6d0-49b3-8bd3-ad286445cd1a","title":"Keynote","Abstract":null,"speakers":[{"id":"9892f3f3-9788-41b3-ba5d-36b99d67d332","name":"Chakrapani Gollapali","twitterHandle":null,"tagline":" \tCountry General Manager, Consumer Channels Group, Microsoft India ","bio":"Chakrapani Gollapali, or Chax as he is better-known, heads the overall consumer business for Microsoft that includes Windows across PCs, Tablets & Phones, Office, and Xbox. Prior to joining Microsoft in 2011, Chax spent over six years at Nokia in a variety of roles. Most notably, he led the team that established and scaled the smartphone business for Nokia in India. With over 20 years of experience, Chax brings expertise in the ICT industry and a deep understanding of how to create scale and impact in emerging markets. In his personal time, Chax enjoys running and living the ‘outdoor’ life, with activities like hiking and rafting.","headshotUrl":"http://teched2013.blob.core.windows.net/images/a913d904-07a0-421f-8107-365ea4df0d82","photo":null}],"begins":"2014-11-06T09:40:00","ends":"2014-11-06T10:30:00","location":"Kalinga 1","Trackid":"f446cc16-0e92-4ade-9f43-b74528948b89","TrackName":"Keynote"},{"id":"fd802d16-8526-4026-8cbb-ae7b1ba42dc9","title":"Storage Services on Microsoft Azure","Abstract":"Join the session to know all about storage options, best practices & deployment scenarios.","speakers":[{"id":"414482b9-2345-4ec0-91ff-2bd8cd40fe34","name":"Govind Kanshi","twitterHandle":null,"tagline":"Technical Director- MTC, Microsoft India","bio":"Govind is the Technical Director at the Microsoft Technology Center (MTC) at Bangalore. Govind manages the various technology practices at MTC and is especially focused on Azure Guidance practice. Having very deep technical experience with SQL Server he is always intrigued by SQL Azure and its capabilities and applications. Over the past year, he has successfully helped customers migrate to Microsoft Azure. Govind has over 20 years of experience of which he has been with Microsoft for more than 10 years.","headshotUrl":"http://teched2013.blob.core.windows.net/images/6fc08379-91c4-4a62-9d60-d938f3779f2a","photo":null}],"begins":"2014-11-06T17:00:00","ends":"2014-11-06T17:55:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"22456f28-fa22-4efc-ab81-b07fc375e2be","title":"Use Team Foundation Servers MTM and Lab Management to make testing & provisioning of testing environment stress free","Abstract":"Do you find managing test plans, authoring test cases and executing test cases in multiple environments a cumbersome activity? Let’s find out how TFS along with MTM and lab management can ease our efforts. How it can help you provide a richer and actionable bug information to developers. How you can provide a snapshot of the environment in which the bug was detected to the developer. How you can become more productive by using Exploratory Testing. Let’s make testing an integrated approach.","speakers":[{"id":"69ca3203-8309-4e00-b5e1-77af9d36ae57","name":"Himanshu Bhardwaj","twitterHandle":null,"tagline":"Technology Solution Specialist, Microsoft India","bio":"Himanshu works as a Technology Solution Specialist on Dev Tools with Microsoft India. He has worked extensible on many industry leading ALM solutions. He has been in industry for 10 years and working on Microsoft technologies close to 2 years. Before joining Microsoft, Himanshu has worked with IBM Rational and HP Software’s. He holds Master in Computer Application and is looking to help customers adopt latest Microsoft technologies specially Visual Studio, Team Foundation server and Azure.","headshotUrl":"http://teched2013.blob.core.windows.net/images/a3255872-0515-4ecd-af03-250ef7ff6947","photo":null}],"begins":"2014-11-06T11:45:00","ends":"2014-11-06T12:40:00","location":"Magadh 1","Trackid":"831a8122-fd75-4d93-a17e-2af292800ded","TrackName":"Dev Tools"},{"id":"d6219ec2-7a39-44ea-9855-b30c40c9365a","title":"What is office Delve ?","Abstract":"Delve helps you discover the information that's likely to be most interesting to you right now - across Office 365. The more you and your colleagues work together, by viewing, editing and sharing each other's documents, the more you will see the power of Delve. Learn More about Office Delve in this talk.","speakers":[{"id":"38f3dd1f-2acc-4932-8a8f-89b779411e30","name":"Suresh Parthasarathy","twitterHandle":null,"tagline":"Research SDE, Microsoft","bio":"I graduated from IIT Bombay with masters in Computer Science in 2008. I worked in Microsoft Bing team (then Live Search) for 3 years mainly on Bing events vertical. In that I worked on data deduplication and ranking problems. Then I switched to Yahoo Research for a year where I worked on Review Ranking problems. In 2012, I joined Microsoft Research India. So far, I worked on various problems on Tables ranking and Delve.","headshotUrl":"http://teched2013.blob.core.windows.net/images/92c23f11-5524-4af4-a4ea-eda4c48aef11","photo":null}],"begins":"2014-11-05T17:00:00","ends":"2014-11-05T17:55:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"27540b54-19d2-488c-8b17-b384049b2a28","title":"IoT Workshop","Abstract":"IoT will debut at TechEd this year and join us for a technical workshop where you get to understand the nuances of building scenarios on Windows. As you know, the proliferation of consumer devices & sensors is driving the industry into a new paradigm called IoT (Internet of Things). This is not a trend that we foresee, but a reality today with plethora of devices and services around us. From a platform standpoint, capability exist today and this workshop focuses to surface out the power of the platform in lighting up devices and enabling you to realize scenarios in the real world. We're bringing windows to a new class of small devices and this workshop should help you take on a journey into the possibilities with windows system on chip powered by services in the Cloud. During the workshop, we'll help you get started with Windows IoT, showcase some Cool demos, walk you through capabilities of Windows IoT(Arduino and other libraries support) and help you understand how Azure plays a pivotal role in realizing your ideas/scenarios. This is a great opportunity to shape your idea and get started. If you already have an “Idea” and prior “expertise”, then this workshop is just designed for you.","speakers":[{"id":"39ba09f7-217e-4f39-8dd0-f12ef7884439","name":"Vikram Khandpur","twitterHandle":null,"tagline":"Principal PM Manager, Internet of Things Group, Microsoft Corporation","bio":"Vikram is the Principal Manager for the IoT Experiences PM organization and is responsible for defining and driving developer programs for IOT client and cloud products with Makers, Consumer and Enterprise customers. With the next generation of our IoT solutions Microsoft is looking beyond its traditional strength in enterprise IoT to encompass a new generation of Developers and Makers. Vikram has also been a co-founder of two mobile companies and is an active Advisor and Mentor on “Microsoft Ventures” where spends time working with start-ups in the IOT, Wearables and Home automation space. Prior to joining the IoT Experiences team Vikram held several leadership roles in Microsoft where he has led the evolution of KINECT sensors on the XBOX team, growth of the Windows ecosystem and delivery of several key pieces of Windows Phone platform. Before joining Microsoft in 2006, Vikram spent time in mobile industries, embedded system and software development working for Philips, Siemens and Nokia Mobile Phones. He holds a degree in Instrumentation and Control Engineering from the University of Delhi and lives in the Seattle area with his wife and their three children.","headshotUrl":"http://teched2013.blob.core.windows.net/images/810d9797-a6a0-42dd-8b7c-aadad5b9c940","photo":null}],"begins":"2014-11-05T19:00:00","ends":"2014-11-05T20:30:00","location":"Kalinga 2","Trackid":"59459941-34cf-4e60-acf4-24646e63550a","TrackName":"IoT"},{"id":"e5fe9219-d80a-43ce-bfa1-b44703769250","title":"Azure Site Recovery: Leveraging Microsoft Azure as your Disaster Recovery Site","Abstract":"Learn how Azure Site Recovery enables seamless use of Azure IaaS as a zero CAPEX Disaster Recovery Site for your on-premises datacenter. We will demonstrate the simplicity and cost-effectiveness of this solution. We will cover management of failover, failback DR activities using Azure IaaS VMs. Network connection—back to datacenter and to the clients—is one of the top challenges in setup of your DR infrastructure and we cover how to simplify networking for disaster recovery setup. We will also detail the investments we have done in security and compliance to ensure your data is safe and meets the compliance needs for your organization.","speakers":[{"id":"b028825c-620b-4ae0-a24f-f0db039a78c8","name":"Prateek Sharma","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft","bio":"Prateek Sharma is a Senior Program Manager with over 10 years of industry experience that includes around 5 years in backup and disaster recovery space. He has been associated with the Azure Site Recovery team since its inception. Prateek focuses on the area of networking for different scenarios of disaster recovery, be it between two private clouds or from a private cloud to a public network. Prateek has a B.Tech in Computer Science from IIT Bombay and is an MBA from Indian School of Business, Hyderabad.","headshotUrl":"http://teched2013.blob.core.windows.net/images/3a69a546-01bf-46cd-abc7-7e1783243989","photo":null},{"id":"69a880e0-902f-472e-b443-c344a465dc12","name":"Anoob Backer","twitterHandle":null,"tagline":"Program Manager, Microsoft India","bio":"Anoob Backer has over 10 years of experience in Web Access Management and Virtualization. He joined Microsoft two years back and has been working as a Program Manager with Microsoft Azure Site Recovery. He works on Managing Protection for Virtual Machines, Billing, Auditing & Reporting. He played key role in defining the right priorities for building a secure and reliable cloud service. Anoob is a documentary Photographer who has a Bachelor of Technology (Electronics) from National Institute of Technology, Calicut.","headshotUrl":"http://teched2013.blob.core.windows.net/images/9c4804ca-412e-41ab-8823-869174b73be3","photo":null}],"begins":"2014-11-05T17:00:00","ends":"2014-11-05T17:55:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"ec5f175e-5e65-45e6-aba4-b47e3b70adf4","title":"Project and Portfolio management in the cloud (Project Online)","Abstract":"A must watch session for Solution Architect, Project Managers & Developer to understand the O365, SharePoint Online & Project Online in nutshell and how they can implement Project & Portfolio management in the cloud using Project Online.","speakers":[{"id":"475d0305-ded9-4bcf-9026-6775df2132bb","name":"Rao Rajendra Singh","twitterHandle":null,"tagline":"Senior PFE, Microsoft India","bio":"Rao Rajendra Singh, or \"Rao\" known among his colleague & friends is one of those individuals, who work and breathe SharePoint and Project Server day-in day-out. An Electrical Engineer by qualification, he has been electrifying the SharePoint & Project Server space with-in and outside Microsoft as a Premier Field Engineer. Prior to this role, Rao was a Technical Architect in couple of Tier-1 Indian and Multi-National IT companies, wherein he envisioned and delivered million dollar projects on SharePoint, BizTalk & Project Server. He is Microsoft’s sole Master Trainer for Project Server/Project Online for APAC region, where he guides, mentors & certifies resources, who are aspiring to become Project server PFE. Rao is a passionate learner with high level of energy, which is very contiguous and noticeable as soon as you meet him. An established Public speaker, he can talk at length on any topic ranging from Project Server, SharePoint to Share-Market.","headshotUrl":"http://teched2013.blob.core.windows.net/images/88fdbb23-6d23-462b-ae96-9b2b71f339db","photo":null},{"id":"170d2cf7-d29a-417d-b7c8-b958458613d3","name":"Pradeep Nair","twitterHandle":null,"tagline":"Sr PFE, Microsoft India","bio":"Pradeep has been working with Microsoft Technology even before the days when Windows 3.1 was in existence. An ex-servicemen, who has risen through the ranks, after retirement, he joined Microsoft as a Premier Field Engineer and has been with Microsoft since the last one year. Prior to that he worked with few of the major multi-national consulting firms and non-profit organization, and managed their client’s SharePoint infrastructure, helping them realize ROI from the implementation. He is a very passionate and self-learned individual, who loves to envision & resolve problems/challenges by providing effective, scalable solutions. In his free time he likes to explore new areas within technology ranging from Quantum Computing to Star-Wars. A die-hard fan of Matrix Trilogy & Minority Report style of movies, he loves politics and firmly believes that technology can play a pivotal role in eradicating corruption within politics, and usage of technology will bring more transparency and accountability.","headshotUrl":"http://teched2013.blob.core.windows.net/images/8c6185b1-aca7-428f-a65d-fac4961fa3d9","photo":null}],"begins":"2014-11-06T17:00:00","ends":"2014-11-06T17:55:00","location":"Magadh 1","Trackid":"61e1822f-1059-4020-bdb3-5c88e7d2f6f4","TrackName":"Online Services"},{"id":"0c175ed7-69dd-4614-9993-b77782003277","title":"ALM on Cloud with Microsoft Visual Studio Online","Abstract":"Come and learn about how the Microsoft cloud solution can enable teams to implement Application Lifecycle Management. Beginning with managing product backlogs, then developing, testing and deploying applications on the cloud. Also learn how continuous Integration and Deployment for Web Applications would be done seamlessly using Microsoft's Hybrid Cloud solution (Visual Studio, Visual Studio Online/Team Foundation Server and Azure).","speakers":[{"id":"99640f34-05e4-49cb-8452-5cd64dc41606","name":"Narendra Rao Sunkada","twitterHandle":null,"tagline":"Technology Solutions Specialist – Dev Tools, Microsoft India","bio":"Narendra works as a Technology Solutions Specialist on Dev Tools with Microsoft India.He has been in the industry for close to 11 years. He has spent considerable amount of his time with various Application Life Cycle Management Tools in the IT Industry. Narendra has spent close to 2 years extensively working on Microsoft technologies including Visual Studio, Team Foundation Server, Visual Studio Online and Azure. He holds a Masters degree in Computer Applications and is passionate about helping customers successfully adopt Microsoft Tools for the Application Life Cycle Management.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c7bd59aa-1053-4489-84b0-5ae750fdce0d","photo":null}],"begins":"2014-11-06T13:45:00","ends":"2014-11-06T14:40:00","location":"Magadh 1","Trackid":"831a8122-fd75-4d93-a17e-2af292800ded","TrackName":"Dev Tools"},{"id":"0d910c6e-c24e-47c8-ba63-be4fa2cee8fd","title":"SharePoint and Office 365 App development on Azure PaaS","Abstract":"This session will help you get started with Apps for SharePoint, understand OAuth and understand SharePoint Hosted and Provider hosted App. This will cover Provider Hosted Apps and SharePoint Hosted Apps.","speakers":[{"id":"84f936bb-5919-41d4-a0da-51001788aa4c","name":"Jojo Koshy","twitterHandle":null,"tagline":"Technology Specialist, Microsoft India","bio":"Jojo Koshy is a Technology Specialist – Productivity at Microsoft India with a broad experience on developing and architecting Portal, Collaboration, Social Computing and Search applications for enterprise customers. He currently focusses on how enterprises can leverage the Microsoft Productivity platform to address their business priorities. Jojo is also a MCM / MCSM ( Microsoft Certified Solutions Master ) on SharePoint. He has been with Microsoft for over 9 years playing various roles like Application Development Manager, Sr. Consultant and Pre-Sales Architect.","headshotUrl":"http://teched2013.blob.core.windows.net/images/b033e639-9176-4de8-b021-3c894aadab44","photo":null}],"begins":"2014-11-05T16:00:00","ends":"2014-11-05T16:55:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"24a377eb-8250-4d07-94eb-be701a94c5db","title":"Introduction to Document DB","Abstract":"Azure now offers a native Document Database-as-a-Service offering, DocumentDB. This is a fully-managed, scalable, NoSQL document database service with rich query and indexing capabilities over a schema-free JSON data model. In this demo-oriented session, we will introduce you to the basic constructs of DocumentDB and core querying and indexing. We'll see how the SQL query language is effectively used with DocumentDB. And we'll go over the various language SDK's available, including .NET and Node.js.","speakers":[{"id":"919b5128-d735-4456-a4b5-bd26404f9968","name":"David Makogon","twitterHandle":null,"tagline":"Sr. SDE, Microsoft","bio":"David Makogon has been a software creationist and architect for over 25 years. He’s currently a Senior Azure Architect at Microsoft, and was an Azure MVP prior to joining Microsoft. David spends lots of energy in the user community, speaking at user groups, conferences and code camps. Outside of computing, David is an avid photographer and family man, with a penchant for puns and an uncanny ability to read backwards.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c75a3c2e-431d-48cc-9046-1afdc2c9c62f","photo":null}],"begins":"2014-11-05T16:00:00","ends":"2014-11-05T16:55:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"85e7860f-47d8-40fc-9a82-c0152857bc3b","title":"Real-time Analysis with Microsoft technologies","Abstract":"Mostly past data get analyzed and in other words there is always the case for latency. The current industry demands the evolution of Big Data and Hadoop solutions from batch oriented jobs to real-time stream based analytics. There are some scenario where data needs to analyze on real time basis. For example, as a shareholder you can’t wait for long hours to take a call on when would I sell my stocks? As a decision maker you don’t want to wait for long to see the people’s reaction on your product. In this session we will explore how we can use Microsoft technologies to do real time analysis. We’ll explore the architecture followed by demo which will cover • Get geo-tagged Tweets in real-time. • Evaluate the sentiment of these Tweets. • Store the sentiment information. • Plot the real-time statistical results. (Using Hbase & ASP.NET application)","speakers":[{"id":"50c1560a-3062-4ad3-958e-ecfdfd5d24fc","name":"Sudhir Rawat","twitterHandle":null,"tagline":"Support Escalation Engineer, Microsoft India","bio":"Sudhir has over 10 years of experience in the IT industry. Before joining Microsoft, he worked on different technologies like Java, .net, Oracle and SQL Server. Presently, he works as a Support Escalation Engineer in Microsoft Big Data Support team. His focuses on Microsoft Business Intelligence suite and Big Data. He is passionate about the magic (Analytic and Mining) that can be done on data, which helps business to deliver great results. Sudhir holds several certifications including Microsoft Certified Technology Specialist, Microsoft Certified IT Professional and Microsoft Certified Trainer in Microsoft SQL Server Business Intelligence. He is also active on various forums like Tech-Ed India, Reboot, social community (www.SQLServerGeeks.com) and various colleges and business units. Sudhir also contributes to his personal blog http://blogs.msdn.com/b/biblog/ as well as the Teams’ blog http://blogs.msdn.com/b/bigdatasupport/","headshotUrl":"http://teched2013.blob.core.windows.net/images/af91a71e-c642-4894-b8cb-9ea77ba5a3fb","photo":null}],"begins":"2014-11-06T11:45:00","ends":"2014-11-06T12:40:00","location":"Magadh 2","Trackid":"3ed6a267-6b27-4dcd-b191-77cc558efc7e","TrackName":"Business Intelligence"},{"id":"df167ddd-f8e4-48e7-87fe-c17e5274e275","title":"Enabling Internet of Your Things with Windows and Azure","Abstract":"Learn about the Internet of things and how to leverage the power of Windows and Cloud (Azure) with IoT scenarios. We will talk about the possibilities of building successful IoT scenarios with Windows and powering with Azure.","speakers":[{"id":"39ba09f7-217e-4f39-8dd0-f12ef7884439","name":"Vikram Khandpur","twitterHandle":null,"tagline":"Principal PM Manager, Internet of Things Group, Microsoft Corporation","bio":"Vikram is the Principal Manager for the IoT Experiences PM organization and is responsible for defining and driving developer programs for IOT client and cloud products with Makers, Consumer and Enterprise customers. With the next generation of our IoT solutions Microsoft is looking beyond its traditional strength in enterprise IoT to encompass a new generation of Developers and Makers. Vikram has also been a co-founder of two mobile companies and is an active Advisor and Mentor on “Microsoft Ventures” where spends time working with start-ups in the IOT, Wearables and Home automation space. Prior to joining the IoT Experiences team Vikram held several leadership roles in Microsoft where he has led the evolution of KINECT sensors on the XBOX team, growth of the Windows ecosystem and delivery of several key pieces of Windows Phone platform. Before joining Microsoft in 2006, Vikram spent time in mobile industries, embedded system and software development working for Philips, Siemens and Nokia Mobile Phones. He holds a degree in Instrumentation and Control Engineering from the University of Delhi and lives in the Seattle area with his wife and their three children.","headshotUrl":"http://teched2013.blob.core.windows.net/images/810d9797-a6a0-42dd-8b7c-aadad5b9c940","photo":null}],"begins":"2014-11-06T14:45:00","ends":"2014-11-06T15:40:00","location":"Kalinga 2","Trackid":"59459941-34cf-4e60-acf4-24646e63550a","TrackName":"IoT"},{"id":"cc2c9f95-b69a-4f2e-b858-c20e082826b7","title":"System Center Automation – Orchestrator and SMA together","Abstract":"As we move into the Cloud OS space with the new Windows Azure Pack it will be important that your existing systems can integrate into the Cloud OS stack to provide end-to-end delivery and management of these new services. This session covers the new Service Management Automation (SMA) feature of Orchestrator in R2 and shows how you can integrate existing Orchestrator runbooks with the new SMA feature. In this session we will look at Real world customer scenarios where we have used Orchestrator including SMA to automate tasks and provide self-service. The best of both features. The SMART conversion tool, connecting Service Manager to SMA, SQL Instance Patching, Orchestrator and SMA integration and general advise on how customers can start preparing for the jump to SMA. Authoring & debugging runbooks best practices in the new Service Management Automation feature of Orchestrator.","speakers":[{"id":"6a1c3047-701e-4c7b-9ddb-1183b0322cf5","name":"Rohit Gulati","twitterHandle":null,"tagline":"Infrastructure Architect, Microsoft Consulting Services, India","bio":"Rohit currently works as an Infrastructure Architect at Microsoft Consulting Services. He has over 11 years of experience in architecture, building and delivering Infrastructure solutions on Microsoft Virtualization, Private Cloud, Microsoft Azure, O365, Unified Communications, System Center and Technology Strategy consulting. He has been a regular speaker at MS TechEd India since 2009. He has also been a key presenters at other Microsoft internal and external events.","headshotUrl":"http://teched2013.blob.core.windows.net/images/0362bd3b-2d02-49b4-84da-8ee07fe4d33f","photo":null}],"begins":"2014-11-05T13:45:00","ends":"2014-11-05T14:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"a62a8240-a211-4cd9-823d-c390ec372ab9","title":"Leveraging SAN Replication to deliver best-in-class enterprise-centric Disaster Recovery solutions using Azure Site Recovery and System Center 2012 R2","Abstract":"Public facing websites for large organizations generally have very strict Service Level Agreements (SLA) for parameters related to Business Continuity Management (BCM) such as High Availability (HA) and Disaster Recovery (DR). Such SLAs can't be met with just with HA capabilities of a SharePoint farm or 99.95% uptime offered by Azure Virtual Machines (VMs) using availability sets. In this session, we will discuss how to meet such demands by implementing two SharePoint farms on two different Azure IAAS data centers (DC) in hot stand-by DR mode that can failover within minutes. We'll do a demo of the auto-failover feature on a live SharePoint environment and explain how we used combination of technologies, SQL Server Always On, Log shipping, Azure Blob storage, and Azure Traffic Manager (ATM) with some support from .NET and Windows Azure power shell to build the above solution.","speakers":[{"id":"0a373190-5bd0-4bbe-ad79-ea12272e54dc","name":"Abhishek Hemrajani","twitterHandle":null,"tagline":"Program Manager, Microsoft India","bio":"Abhishek Hemrajani is a Program Manager for Azure Site Recovery, Microsoft's DRaaS offering. Abhishek has over 8 years of experience in the US Telecommunications industry and Software Product Management. Abhishek focuses on the Storage Configuration and Management, Private Cloud Configuration, Service Business Continuity, and Compliance and Privacy scenarios for Azure Site Recovery. Abhishek has a Bachelor of Engineering (Information Technology) from University of Mumbai, a Master of Science (Computer Science) from The University of Texas at Arlington, and a MBA (Marketing & Strategy) from the Indian School of Business, Hyderabad.","headshotUrl":"http://teched2013.blob.core.windows.net/images/aa1fdc85-c1cb-414c-a136-2a0f0dfd3bc7","photo":null}],"begins":"2014-11-06T11:45:00","ends":"2014-11-06T12:40:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"807fe8a9-741e-432a-ab98-c4ebf9cb680d","title":"Azure Resource Management","Abstract":"As apps are deployed on to Azure, one of the major maintenance task is to ensure that all tiers/machines are setup keeping in mind the dependencies and then combine all these tiers/machines to run the app in an expected way. The challenge is also to have the setup task repeated for multiple team such as Development, Testing, … and in production for one or more customers. This session deals with all of these challenges and demonstrates deploying the app on Azure as a simple, quick and repeatable task.","speakers":[{"id":"92e33329-d7fb-41df-8799-31140ef1793f","name":"Mohammed Nasiruddin","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft","bio":"Muhammad has been one of the first few advocates of Azure since its inception and has been an evangelist for Microsoft technologies for over 15 years. At Microsoft, he is responsible for evangelizing Azure and assisting partners and customers in adopting Azure. He has also been instrumental in architecting, designing, developing and testing a large number of apps on Azure. As part of his role, he works on deploying a wide range of Open Source Technologies on Azure including Java, PHP, Drupal, MySQL, Mongo DB, Hadoop, etc.","headshotUrl":"http://teched2013.blob.core.windows.net/images/4d13f8ab-71ea-4a37-bb05-9efb433314dc","photo":null}],"begins":"2014-11-05T17:00:00","ends":"2014-11-05T17:55:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"},{"id":"b9043550-8e0b-4ffa-b7c8-cb326cc75260","title":"Microsoft Azure Websites : All you want to know","Abstract":"Microsoft Websites is one of the most used services in the Windows Azure platform. With Azure websites, it is easy to create, manage, deploy, and scale a web site. In this session we will review common payloads and usage pattern of Azure Web Sites. You will also learn how to run webjobs on your websites.","speakers":[{"id":"9a7f8587-c7c3-4c91-9b5b-9c968ddd38d3","name":"Gandhali Samant","twitterHandle":null,"tagline":"Technology Evangelist, Microsoft India","bio":"Gandhali is a Technology Evangelist at Microsoft India and her areas of expertise include Windows Azure as well as Windows 8 and Windows Phone. She has been working with Microsoft's products & technologies for over 13 years. Prior to Microsoft, Gandhali worked with various MNCs in India and abroad, and in the insurance and retail domain. In her current role, Gandhali helps partners, customers and developers build world-class solutions on the Microsoft cloud platform. A graduate in Computer Engineering from Mumbai University, Gandhali has done her Masters in Computer Science from Florida Institute of Technology. You can follow her on Twitter @s_gandhali","headshotUrl":"http://teched2013.blob.core.windows.net/images/1e910960-d90a-48cb-8525-b2e5170c3d23","photo":null},{"id":"e3a5f479-08b2-4510-82f8-5960ad655e1a","name":"Sameeksha Khare","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft India ","bio":"Sameeksha Khare is currently working as a Technical Evangelist with Microsoft Corporation, India. In her current role she is working with developers and students focusing on Windows 8.1 and Windows Phone 8.1 app development. She blogs her technical learnings and experiences quiet regularly at http://blogs.technet.com/b/sams_blog/ . She loves to interact with students and community folks across India. In her spare time she listens to music, enjoys good food and hang out with friends. You can follow her on twitter @SameekshaKhare.","headshotUrl":"http://teched2013.blob.core.windows.net/images/6cf9dded-1d72-4fba-96b7-6a7c62093521","photo":null}],"begins":"2014-11-05T16:00:00","ends":"2014-11-05T16:55:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"81db23c4-83a9-45c2-b842-ce1a1912063a","title":"Architecture ethos for Internet of Things( IoT)","Abstract":"As the world of IoT is emerging, it has thrown new opportunities and considerations to practicing architects. Enterprise architects play a critical role in developing service offer definitions in the new world of device and Cloud OS future. Business, technical and industry reference architectures are important components in driving and measuring the value realized in investments on IoT projects. Architecture patterns are perhaps the most important tool that architects use, but in the new world of IoT , there is significant variation in the type of patterns and the approach in adopting them. In this session we will define IoT opportunities and challenges, examine the various IoT patterns and discuss the impact of IoT wave on the computing industry.","speakers":[{"id":"521d8fc9-da85-40ad-a6fc-4e47008a2248","name":"Muni Pulipalyam","twitterHandle":null,"tagline":"Senior architect MCS, Microsoft India","bio":"Muni is a 20-year seasoned Microsoft technology professional working in Microsoft Consulting Services since 2000. He has delivered some of the most technically challenging assignments across the world. Spanning across Windows Client deployments, application compatibility, SQL to Oracle Migration, .NET COEs, architecting solution for a large project for the Healthcare ISV to, now, Azure assessments, Muni has had the privilege of working on the majority of Microsoft products. Apart from the application platform, Muni also has unique insights into the Microsoft infrastructure stack. He has been one of the 4 members of the worldwide Windows Application Experience SWAT team and also part of the Internet Explorer 8.0 product management team.","headshotUrl":"http://teched2013.blob.core.windows.net/images/637c43c5-78e5-4aaf-9136-264fa1b60664","photo":null}],"begins":"2014-11-06T10:45:00","ends":"2014-11-06T11:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"f510b531-246c-4ffe-b75d-ceac4eda2782","title":"Be Smart with Managed Backup a.k.a Smart Backup!!!","Abstract":"They say Work Smart!!! SQL Server 2014 intriduces Managed backup whcih is a smart way of managing your full and transaction log backups. Yes you heard it correctly, we manage it for you , on your behalf. Join me in knowing the architecture of SQL Server Managed Backup - a.k.a Smart Backup , know how it all works behind the scene along with how to ensure your Business continuity is up and running.ments.","speakers":[{"id":"127c9ba5-13be-4dfb-b387-cf2090ba6c8b","name":"Pranab Majumdar","twitterHandle":null,"tagline":"Escalation Engineer, Microsoft India","bio":"Pranab is an Escalation Engineer and is aligned with the SQL group for the past 10 years. He has a vast experience primarily in SQL Server Engine and Performance areas. He has created or contributed to training courses and KB articles / Whitepapers for the Microsoft Knowledge base. He works very closely with the SQL Server Product Team to fix bugs within the SQL Server Product thereby making SQL a better and preferred RDBMS. He holds a number of Microsoft certifications like MCAD, MCSD,MCDBA, MSCE, MCTS , MCITP and MCT since 2005. Pranab has also been a speaker in TechEd, SQL Saturday , SQL Talks, and other Community UG Events.","headshotUrl":"http://teched2013.blob.core.windows.net/images/4b76fb76-e9ad-47fb-8734-ecb1a024e514","photo":null}],"begins":"2014-11-05T17:00:00","ends":"2014-11-05T17:55:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"5ca0f4d5-9a02-4178-b2a4-d32866b3e336","title":"How Architecture and Design influence to Cost Savings on Cloud","Abstract":"Cloud Offers Scale and fault-tolerance, it offers elasticity and security. But Weakest link can be the application hosted on cloud with poor architecture and design which cannot leverage the Power of Cloud. It is important for Architects to understand the levers which influence costs and also understands the monitoring frameworks and tools which will allow you to control the costs. This session helps in bringing the practical experiences demonstrating how a careful architecture patterns and design concepts can help in building solution to mange costs effectively by utilitizing the full power of cloud. Be it licenses, be it compute power, be it Storage choices, be it network design - all requires detailed thought structure keeping in functional, non-functional characteristics, dynamic behavior of resources based on workload to control the direct and indirect cost parameters. The Key takeaway from this session is to carry the knowledge of managing costs on the cloud using architecture and design principles.","speakers":[{"id":"dd5ec369-c586-4c58-b552-ce8130b82eef","name":"Bala Peddagari","twitterHandle":null,"tagline":"Head of Hitech TEG, TCS","bio":"Bala Prasad Peddigari (Bala) has been working with Tata Consultancy Services Limited for over 16 years. He practices enterprise architecture, evangelizes platform solutions and performance engineering solutions on the Microsoft platform alongside scalable architectures and Cloud technology initiatives within TCS. Currently, Bala heads the Technology Excellence Group and Innovation Management for HiTech Vertical. He drives the architecture and technology community initiatives within TCS through coaching and mentoring. Bala has a Masters in Computer Applications from University College of Engineering, Osmania where he was the top ranking student. Bala is an Open Group Master IT Certified Architect and serves as a board member in Open Group Certifying Authority and is also a board member at Computer Measurement Group, India. He received accolades for his cloud architectural strengths and published his papers in IEEE and is a regular speaker at Open Group Conference and technology events. Bala is a Working Group member in Open Group for Cloud and Open Platform 3 working groups.","headshotUrl":"http://teched2013.blob.core.windows.net/images/27438598-d33b-4d3b-a2a6-1e99e41aed33","photo":null}],"begins":"2014-11-05T14:45:00","ends":"2014-11-05T15:40:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"ec561728-4e73-413e-94ef-d72b908217d1","title":"SQL Server 2014 Online Operation enhancements","Abstract":"No DBA would like their 24x7 mission critical OLTP application to be down just for database maintenance activities. This demo filled session shows you how you can leverage new enhancements for two of the most common database administration tasks - Partition Switching and Online Index Rebuilds and make them run efficiently thereby improving application availability.","speakers":[{"id":"5a4e53ae-f9b4-4adf-b78f-26a9bc9d1600","name":"Vinod Kumar M","twitterHandle":null,"tagline":"MTC- Technical Architect, Microsoft India","bio":"Vinod Kumar has worked with SQL Server extensively for more than a decade now. Working on various versions from SQL Server 7.0, Oracle 7.3 and other database technologies, he now works with Microsoft Technology Center (MTC) as a Technology Architect. With extensive database, BI and application background, he currently helps customers maximize investments on technologies to solve real world business, architecture and technology integration problems. He has worked on various roles and projects involving development, migration, deployment, networking, architecture, testing, performance troubleshooting, packaging, R&D for services and product based companies. Vinod holds 26+ Microsoft certification on various technologies till date and was a MVP in SQL Server for more than 3 years. He has published several articles on SQL Server in his site www.ExtremeExperts.com, as well as on other third party sites. He has also authored two books - SQL Server Interview Questions and Answers for all Database Developers and Database Administrators and SQL Server 2012 AlwaysOn Joes 2 Pros (R): A Tutorial for Implementing High Availability and Disaster Recovery Using Alwayson Availability.","headshotUrl":"http://teched2013.blob.core.windows.net/images/1e236373-2652-4100-9113-88b78dafc147","photo":null}],"begins":"2014-11-05T13:45:00","ends":"2014-11-05T14:40:00","location":"Magadh 2","Trackid":"a7d4670a-914a-494b-a6fd-9f85a3ba710b","TrackName":"SQL Server"},{"id":"9ba37dbe-75c1-4bcf-821f-d7f943ca5f32","title":"Architecting SAP Solutions on Azure","Abstract":"In this session we will go through scenarios of deploying SAP NetWeaver applications like SAP ERP, CRM, BW, etc. on Azure Virtual machine services. We will discuss various scenarios(Prod vs. Non Prod), reference architectures for SAP deployments on Azure, customer use cases & case studies.","speakers":[{"id":"5642d864-7000-4604-8bf1-db1ba31253ef","name":"Sujesh Kodoth","twitterHandle":null,"tagline":"Senior Consultant MCS , Microsoft India","bio":"Sujesh Kodoth has 15 years of industry experience in information technology and has been working with Microsoft India for the past 6 years. He has vast experience in architecting, designing and developing solutions on various Microsoft technologies and platforms. He has proven experience in cloud computing, primarily on Microsoft Azure platform, where he has worked with CxOs in establishing a cloud strategy and provide technology roadmap for existing and new applications for cloud deployment model. He has implemented various EAI/B2B/B2C solutions for many customers in banking, insurance, manufacturing and utilities vertical. He has also worked in the capacity of a Trusted Advisor to Microsoft's top end enterprise customers, providing consulting on IT Architecture & Planning. He is a Microsoft Certified Professional on BizTalk Server and Microsoft Azure","headshotUrl":"http://teched2013.blob.core.windows.net/images/df832762-2b03-48f3-9675-fe7a1b8ec8a8","photo":null},{"id":"57907ab9-4686-4ebb-8655-82f7c1b5ebce","name":"Norman Sequeira","twitterHandle":null,"tagline":"Senior Consultant MCS, Microsoft India","bio":"Norman is a Cloud Solution Architect at Microsoft India and has been with Microsoft India for over 14 years. He has worked on multiple turnkey projects for customers in Media and Retail industries. Norman is regarded as an SME on e-commerce and integration technologies and has been consulting on Microsoft Azure for the last few years. He is a Microsoft Certified Professional on BizTalk Server and Microsoft Azure.","headshotUrl":"http://teched2013.blob.core.windows.net/images/c63b8396-8258-4cf3-b7ab-c5f122cf2153","photo":null}],"begins":"2014-11-05T17:00:00","ends":"2014-11-05T17:55:00","location":"Kalinga 2","Trackid":"be373f06-cd70-4b3d-b897-8dd58ffc560a","TrackName":"Architecture"},{"id":"71275e80-1003-4d38-828f-e01aa2740755","title":"StorSimple - Hybrid Storage","Abstract":"StorSimple and Microsoft Azure offer a unique hybrid cloud storage solution, which provides primary storage, archive and disaster recovery. This solution optimizes total storage costs and data protection for enterprises. One of the biggest challenges facing enterprise storage customers is massive data growth and the amount of storage management work required to keep up with it. StorSimple 8000 series hybrid storage arrays excel at managing data growth and stopping the endless cycle of buying storage.","speakers":[{"id":"a00cc013-846c-47c7-aa3b-db6210e0c158","name":"Manu Aery","twitterHandle":null,"tagline":"Senior Program Manager, Microsoft","bio":"Manu Aery is a Senior Program Manager with over 9 years of experience across various product groups in Microsoft, including Windows Security, Online Advertising and more recently the Cloud and Enterprise division working on StorSimple","headshotUrl":"http://teched2013.blob.core.windows.net/images/b140397f-1e38-4019-b089-5fcb9433ff38","photo":null},{"id":"838bcdb0-8e99-44bb-bbd4-83b6ed007d11","name":"Raju Nagalinga S","twitterHandle":null,"tagline":"Program Manager, Microsoft India","bio":"Raju is a program manager in the Microsoft StorSimple Team. StorSimple is a hybrid cloud storage solution which provides primary storage, archive and disaster recovery.","headshotUrl":"http://teched2013.blob.core.windows.net/images/1d08db9a-3440-40b3-93b1-b296c4eef9c5","photo":null}],"begins":"2014-11-05T17:00:00","ends":"2014-11-05T17:55:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"2674d8f3-dcc6-4b73-ad97-e2f553800073","title":"Closing keynote","Abstract":null,"speakers":[{"id":"af804719-dd38-48b6-80c1-6befc814835b","name":"Joseph Landes","twitterHandle":null,"tagline":"General Manager, Developer Experience &amp; Evangelism, Microsoft India ","bio":"Joseph is a 17 year veteran of Microsoft and has been in a variety of roles both in Sales & Marketing and Business Groups. These include 5 years in OEM Sales, 5 years with Server and Tools and a stint in Europe as the Server Business Group Lead in Central and Eastern Europe. Joseph led the biggest IT Pro and Developer launch in the history of Microsoft with the ‘Heroes Happen Here' launch of Windows Server 2008, SQL Server 2008, and Visual Studio 2008. Joseph is an avid reader and sports fan, and is looking forward to visiting every state and union territory in India.","headshotUrl":"http://teched2013.blob.core.windows.net/images/faecd774-287a-449b-bb26-f4573a53b43f","photo":null},{"id":"02abdab3-b903-419d-bca5-2a5c9e6fc994","name":"S Sadagopan","twitterHandle":null,"tagline":"Director of IIIT, Bangalore ","bio":"Professor Sadagopan, Director of IIIT-Bangalore, is a product of Madras University, India and Purdue University, USA. He taught for 25+ years at IIT Kanpur, IIM Bangalore, IIT Madras and IIIT-Bangalore in addition to short teaching assignmentsatRUTGERS,USAandAIT,Bangkok. He has authored seven books, several book chapters and papers. He is a Fellow of IEE (UK) and Computer Society of India. He is a Senior Member of IEEE, ACM and AIS. He consults widely and lectures extensively on all aspects of IT. He serves on the boards of Vignyani Industries Limited (A fully owned subsidiary of BEML Limited) National Stock Exchange, Indian Overseas Bank, National Payment Corporation of India, Mumbai, BEML Ltd, Bangalore also served on Bharat Electronics, Neyveli Lignite Corporation and Indian Renewable Energy Agency as well as several Universities / Institutes - IIIT-Gwalior, Jain University, IDRBT, IBAB, ISIM, IIIT Bhubaneshwar and IIIT-Delhi. He serves as a Member of Karnataka Knowledge Commission, Chief Minister's Vision Group on IT, NASSCOM Regional Council, Indian Electronics Semiconductor Association (IESA) Executive Council and ACM India Council. He is the Chair of IEEE Computer Society, Bangalore Chapter.","headshotUrl":"http://teched2013.blob.core.windows.net/images/dff3da0a-8aba-4e94-826a-ee4785bc420c","photo":null}],"begins":"2014-11-06T18:15:00","ends":"2014-11-06T19:15:00","location":"Kalinga 1","Trackid":"f446cc16-0e92-4ade-9f43-b74528948b89","TrackName":"Keynote"},{"id":"57a55088-990f-4a7d-8039-e4460704a927","title":"Cross Platform App Development","Abstract":"- This session is targeted to cover following topics: - Cross Platform Dev Options - Pros and Cons of each (UX, Dev Effort, Time to go live, etc.) - Misconceptions of Cross plat dev. and when to use what - Challenges faced by customers - Customer Success stories","speakers":[{"id":"f5c5552f-01a6-4158-8d9e-53804312d0f2","name":"Abhishek Narain","twitterHandle":null,"tagline":"Technical Evangelist, Microsoft India","bio":"As a Technical Evangelist at Microsoft India, Abhishek helps developers adapt to the latest Microsoft technologies. Previously, he was a consultant at Microsoft focused on ASP.NET, Azure, Windows Phone, Client web technologies and Game development. He is a regular speaker at Microsoft TechEd, .NET User Groups. Prior to Microsoft, Abhishek was working at Infragistics – a leading UI/UX company. He has worked extensively on HTML5 and was awarded the Microsoft MVP award while working outside Microsoft.","headshotUrl":"http://teched2013.blob.core.windows.net/images/79b071bb-3390-44f1-8073-41cb00894fd6","photo":null},{"id":"5e127192-550f-461a-9d08-eefdc6e5d01c","name":"Jaydeep Khanpara","twitterHandle":null,"tagline":"Consultant, Microsoft ","bio":"Jaydeep has been working with Microsoft Global Delivery, India as a consultant since January 2012. He has over 8 years of experience developing Web and Windows applications using C#, ASP.NET and SQL Server. Jaydeep has also worked on customer engagements targeting Windows Phone 8, Windows 8 Store and cross platform application development. He loves mobile games and develops cross-platform games using Xamarin, Cordova and Unity in his spare time.","headshotUrl":"http://teched2013.blob.core.windows.net/images/e9fed160-cada-4c2e-9252-e41a2d896a41","photo":null}],"begins":"2014-11-05T11:45:00","ends":"2014-11-05T12:40:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"ca7e3414-bc45-4fc5-9b10-ec427108672d","title":"Designing for Connected Devices","Abstract":"With the advent of digital disruptions, as every business turns into a digital business, enterprises are increasingly looking to explore the power of connected devices, systems, peoples and insights. In this session we will showcase how we could write an app once and deploy it across a spectrum of connected devices. This session is going to focus on Xamarin Forms and Azure Mobile service and how we could leverage both these technologies to design for connected devices.","speakers":[{"id":"7f5cd31b-0b79-4f61-b454-ec1ffd1a0ba2","name":"Chaitra Nagaraj","twitterHandle":null,"tagline":"Associate Manager, Accenture ","bio":"Chaitra is currently part of the Avanade Mobility group of Accenture. She has been a Microsoft MVP for 7 years. She is a regular speaker at the Microsoft Community events. She is part of Bangalore DotNet User Group (BDotNet) and is a regular speaker at their events. Her current passion has been concentrating on the digital world with special emphasis on Internet of Things (IoT).","headshotUrl":"http://teched2013.blob.core.windows.net/images/f4a206ec-2537-4798-ba3d-b3ec90013287","photo":null}],"begins":"2014-11-06T16:00:00","ends":"2014-11-06T16:55:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"876e1bd9-6eec-4a09-9e7b-ecb910cb0012","title":"Hybrid Identity & access management with Azure Active Directory","Abstract":"Azure Active Directory is an enterprise-level identity and access management cloud solution. Azure Active Directory Premium, built on top of the core offering of Azure AD, provides a robust set of capabilities to empower enterprises with more demanding needs on identity and access management. In this session we present all of the new features of this premium offering: Single Sign-on to hundreds of popular SaaS application, Group-based access management, Self-Service Password reset, Security reporting, Multi-factor authentication, and more.","speakers":[{"id":"2c496ecc-ee56-4ef1-9dcc-a4c28fbf435c","name":"Vishal Shirodkar","twitterHandle":null,"tagline":"Technology Specialist, Microsoft India","bio":"Vishal Shirodkar is the TSP for Azure and working with Microsoft Enterprise and Partner Group. His area of expertise includes the entire gamut of infrastructure solutions with special focus on Security, Management, Interoperability , Virtualization, and Networking. In his current role he also focusses on Azure , Private cloud and Hybrid Solutions. He has close to 15yrs of IT experience in various functions across system administration , designing and implementing solutions across the infrastructure stack. He is a CISSP, MCSE, MCST and ITILv4 certified. He has also passed his CISA and CISM exams. He is a regular speaker at Microsoft Events.","headshotUrl":"http://teched2013.blob.core.windows.net/images/b34f203b-0d5d-4162-b477-0b2f29cd3451","photo":null}],"begins":"2014-11-05T16:00:00","ends":"2014-11-05T16:55:00","location":"Magadh 4","Trackid":"e40e3e12-191d-4e88-8b38-adaefba8d6f3","TrackName":"DataCenter trends"},{"id":"9235f528-1de9-4ef4-8ecd-f2fd801b99f1","title":"A Dev/Ops Perspective - Application Insights for Services: Performance, Availability & Usage","Abstract":"Application Insights delivers the holy grail of easily determining how customers are using your application, what their experiences are, and the environments your customers are using, and ensuring your applications are successful in meeting your business needs. Application Insights is a new service for monitoring your applications' availability, performance, and usage. The session will cover deep dive on Application insights.","speakers":[{"id":"6a1c3047-701e-4c7b-9ddb-1183b0322cf5","name":"Rohit Gulati","twitterHandle":null,"tagline":"Infrastructure Architect, Microsoft Consulting Services, India","bio":"Rohit currently works as an Infrastructure Architect at Microsoft Consulting Services. He has over 11 years of experience in architecture, building and delivering Infrastructure solutions on Microsoft Virtualization, Private Cloud, Microsoft Azure, O365, Unified Communications, System Center and Technology Strategy consulting. He has been a regular speaker at MS TechEd India since 2009. He has also been a key presenters at other Microsoft internal and external events.","headshotUrl":"http://teched2013.blob.core.windows.net/images/0362bd3b-2d02-49b4-84da-8ee07fe4d33f","photo":null},{"id":"48c7ea16-ad4e-4312-b1d3-b8b8760519b5","name":"Vikas Goyal","twitterHandle":null,"tagline":"Senior Consultant, Microsoft Consulting Services, India","bio":"Vikas works as a Senior Consultant at MCS India. His areas of focus include Customer Experience, Cloud Application Platform, DevOps & Machine Learning. He has a decade of product engineering experience and now designs and builds modern applications with customers and partners.","headshotUrl":"http://teched2013.blob.core.windows.net/images/fc765901-1bfc-47ba-b59b-86180f4acc11","photo":null}],"begins":"2014-11-06T11:45:00","ends":"2014-11-06T12:40:00","location":"Kalinga 1","Trackid":"1f4fead9-3fcc-4b11-9c92-29417c4d6cd7","TrackName":"Azure - Track A"},{"id":"a46a3c38-6a0e-4ada-8a22-fa2c7ab29b87","title":"Developer Information Assistants","Abstract":"The popularity of sites like StackOverflow indicates the need developers have for specific information during all phases of the software development lifecycle. However, these sites can only satisfy information needs as far as public data sources are concerned. For private data sources like code, or bugs, there are few technologies that developers can use to get assistance with their day to day tasks; for example, to fix a bug, or to know the impact of a check-in. Further, knowledge that can help resolve such queries are often locked away in the minds of senior developers and is unearthed only by asking the right expert. This leads to decreased productivity across the board; junior developers spend a lot of time trying to find the right expert to answer their queries and senior developers spend time fielding these queries. All is not lost however - the situation can be remedied by developing tools that specifically cater to the information needs of developers. In this talk, we highlight the need for such tools, particularly for large software projects, and provide examples and user studies of such tools that were implemented in Microsoft Research.","speakers":[{"id":"39ca18ee-2225-4f8b-bb09-ca2d43c87f9e","name":"Gopal Srinivasa","twitterHandle":null,"tagline":"Research SDE, Microsoft India","bio":"Gopal Srinivasa is a Research SDE with the Advanced Development Group, MSR India. His primary area of interest is in building tools that enhance the productivity of software developers. Gopal has a Masters’ degree in Computer Science from North Carolina State University.","headshotUrl":"http://teched2013.blob.core.windows.net/images/a51d236d-64a0-4903-ba2e-6add8984f97d","photo":null}],"begins":"2014-11-06T17:00:00","ends":"2014-11-06T17:55:00","location":"Magadh 3","Trackid":"28595a8e-01f0-4360-8a9d-8c2deddc6e45","TrackName":"Dev Platform"},{"id":"86b6ff30-c43e-4c1d-825c-fc563cfa4170","title":"Best practices for moving your real world on-premise deployments to Microsoft Azure","Abstract":"Do you have servers in the data centre? A friend told you Microsoft Azure can ease your life and you can move your deployments to cloud. It looked easy but turns out not when you start doing it? In this session, we will talk about the learnings from the field in moving small to big workloads on Azure. We will share the dos don’ts, the limits, quotas and constraints when moving to Azure. We will cover, typical scenarios of Infrastructure as a Service (IAAS), including best practices with SQL, Sharepoint, Networks, Storage etc. You are not expected to know a lot about Azure to attend this session, however an understanding of IAAS on Cloud would be helpful.","speakers":[{"id":"8c63d2ad-eeef-40e7-8b43-ec130b5ad0d5","name":"Bijoy Singhal","twitterHandle":null,"tagline":"Technology Specialist – Azure, Microsoft India","bio":"In his current role as an Azure Technology Solutions Professional, Bijoy helps customers understand Microsoft Azure offerings, architect and implement viable solutions on it. With an overall experience of 15 years, Bijoy has spent the last 9+ years performing various roles in Microsoft, dealing with various technologies and helping customers and partners build solutions using VC++, MFC, .NET, Compact Framework, Windows Phone and now Azure. He loves creating tools and solutions, playing around with APIs and sometimes building his own. To stay away from his laptop – he reads or just sleeps!","headshotUrl":"http://teched2013.blob.core.windows.net/images/074a53c4-3c92-4a8a-8537-c04c781019de","photo":null},{"id":"049bc16f-d5aa-4b3b-ae05-2c7f46d71ee0","name":"Sarvashrestha Paliwal","twitterHandle":null,"tagline":"Sr Product marketing Manager, Microsoft India","bio":"Sarvashrestha, known as Pali has over 13 years of combined management and technical experience in enterprise software and IT services industries. In his current role, Pali is responsible for driving Azure business for Microsoft in India. Additionally, Anirudh also runs the Security & Privacy Initiative to keep our customers and partners protected and secure at all times.","headshotUrl":"http://teched2013.blob.core.windows.net/images/2d211683-2d63-48ec-9598-9a8d9937b2f7","photo":null}],"begins":"2014-11-05T11:45:00","ends":"2014-11-05T12:40:00","location":"Magadh 1","Trackid":"4b0adab1-2042-41cd-89fc-873a8187e013","TrackName":"Azure - Track B"}]